{"meta":{"title":"jeacry's blog","subtitle":"修心","description":"","author":"jeacry","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2023-03-03T07:15:52.000Z","updated":"2023-03-03T07:23:14.835Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"我写博客主要是记录一些自己的日常和学习，记录一下自己的思想经历，希望读越来越多的书，也希望遇见越来越多的人。 内容简陋，仅供自娱自乐，如果冒犯，请联系！ 联系方式：&#106;&#x65;&#x61;&#x63;&#x72;&#121;&#x40;&#x74;&#111;&#109;&#x2e;&#x63;&#x6f;&#109;"},{"title":"tags","date":"2023-03-03T06:59:48.000Z","updated":"2023-03-03T07:12:44.320Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"two","slug":"two","date":"2023-03-04T06:35:26.000Z","updated":"2023-03-08T06:44:10.002Z","comments":true,"path":"2023/03/04/two/","link":"","permalink":"http://example.com/2023/03/04/two/","excerpt":"I’m here to offer you a new way to think about my field, artificial intelligence. I think the purpose of AI is to empower humans with machine intelligence. And as machines get smarter, we get smarter. I call this “humanistic AI” – artificial intelligence designed to meet human needs by collaborating and augmenting people. Now, today I’m happy to see that the idea of an intelligent assistant is mainstream. It’s the well-accepted metaphor for the interface between humans and AI. And the one I helped create is called Siri.","text":"I’m here to offer you a new way to think about my field, artificial intelligence. I think the purpose of AI is to empower humans with machine intelligence. And as machines get smarter, we get smarter. I call this “humanistic AI” – artificial intelligence designed to meet human needs by collaborating and augmenting people. Now, today I’m happy to see that the idea of an intelligent assistant is mainstream. It’s the well-accepted metaphor for the interface between humans and AI. And the one I helped create is called Siri. 00:42 footnotefootnoteYou know Siri. Siri is the thing that knows your intent and helps you do it for you, helps you get things done. But what you might not know is that we designed Siri as humanistic AI, to augment people with a conversational interface that made it possible for them to use mobile computing, regardless of who they were and their abilities. 01:06Now for most of us, the impact of this technology is to make things a little bit easier to use. But for my friend Daniel, the impact of the AI in these systems is a life changer. You see, Daniel is a really social guy, and he’s blind and quadriplegic, which makes it hard to use those devices that we all take for granted. The last time I was at his house, his brother said, “Hang on a second, Daniel’s not ready. He’s on the phone with a woman he met online.” I’m like, “That’s cool, how’d he do it?” Well, Daniel uses Siri to manage his own social life – his email, text and phone – without depending on his caregivers. This is kind of interesting, right? The irony here is great. Here’s the man whose relationship with AI helps him have relationships with genuine human beings. And this is humanistic AI. 02:07 footnotefootnoteAnother example with life-changing consequences is diagnosing cancer. When a doctor suspects cancer, they take a sample and send it to a pathologist, who looks at it under a microscope. Now, pathologists look at hundreds of slides and millions of cells every day. So to support this task, some researchers made an AI classifier. Now, the classifier says, “Is this cancer or is this not cancer?” looking at the pictures. The classifier was pretty good, but not as good as the person, who got it right most of the time. 02:46But when they combine the ability of the machine and the human together, accuracy went to 99.5 percent. Adding that AI to a partnership eliminated 85 percent of the errors that the human pathologist would have made working alone. That’s a lot of cancer that would have otherwise gone untreated. Now, for the curious, it turns out that the human was better at rejecting false positives, and the machine was better at recognizing those hard-to-spot cases. But the lesson here isn’t about which agent is better at this image-classification task. Those things are changing every day. The lesson here is that by combining the abilities of the human and machine, it created a partnership that had superhuman performance. And that is humanistic AI. 03:42Now let’s look at another example with turbocharging performance. This is design. Now, let’s say you’re an engineer. You want to design a new frame for a drone. You get out your favorite software tools, CAD tools, and you enter the form and the materials, and then you analyze performance. That gives you one design. If you give those same tools to an AI, it can generate thousands of designs. 04:10 footnotefootnoteThis video by Autodesk is amazing. This is real stuff. So this transforms how we do design. The human engineer now says what the design should achieve, and the machine says, “Here’s the possibilities.” Now in her job, the engineer’s job is to pick the one that best meets the goals of the design, which she knows as a human better than anyone else, using human judgment and expertise. In this case, the winning form looks kind of like something nature would have designed, minus a few million years of evolution and all that unnecessary fur. 04:48 footnotefootnoteNow let’s see where this idea of humanistic AI might lead us if we follow it into the speculative beyond. What’s a kind of augmentation that we would all like to have? Well, how about cognitive enhancement? Instead of asking, “How smart can we make our machines?” let’s ask “How smart can our machines make us?” I mean, take memory for example. Memory is the foundation of human intelligence. But human memory is famously flawed. We’re great at telling stories, but not getting the details right. And our memories – they decay over time. I mean, like, where did the ‘60s go, and can I go there, too? 05:34(Laughter) 05:36But what if you could have a memory that was as good as computer memory, and was about your life? What if you could remember every person you ever met, how to pronounce their name, their family details, their favorite sports, the last conversation you had with them? If you had this memory all your life, you could have the AI look at all the interactions you had with people over time and help you reflect on the long arc of your relationships. What if you could have the AI read everything you’ve ever read and listen to every song you’ve ever heard? From the tiniest clue, it could help you retrieve anything you’ve ever seen or heard before. Imagine what that would do for the ability to make new connections and form new ideas. 06:26And what about our bodies? What if we could remember the consequences of every food we eat, every pill we take, every all-nighter we pull? We could do our own science on our own data about what makes us feel good and stay healthy. And imagine how this could revolutionize the way we manage allergies and chronic disease. 06:52I believe that AI will make personal memory enhancement a reality. I can’t say when or what form factors are involved, but I think it’s inevitable, because the very things that make AI successful today – the availability of comprehensive data and the ability for machines to make sense of that data – can be applied to the data of our lives. And those data are here today, available for all of us, because we lead digitally mediated lives, in mobile and online. 07:31In my view, a personal memory is a private memory. We get to choose what is and is not recalled and retained. It’s absolutely essential that this be kept very secure. 07:45Now for most of us, the impact of augmented personal memory will be a more improved mental gain, maybe, hopefully, a bit more social grace. But for the millions who suffer from Alzheimer’s and dementia, the difference that augmented memory could make is a difference between a life of isolation and a life of dignity and connection. 08:12We are in the middle of a renaissance in artificial intelligence right now. I mean, in just the past few years, we’re beginning to see solutions to AI problems that we have struggled with literally for decades: speech understanding, text understanding, image understanding. We have a choice in how we use this powerful technology. We can choose to use AI to automate and compete with us, or we can use AI to augment and collaborate with us, to overcome our cognitive limitations and to help us do what we want to do, only better. And as we discover new ways to give machines intelligence, we can distribute that intelligence to all of the AI assistants in the world, and therefore to every person, regardless of circumstance. And that is why, every time a machine gets smarter, we get smarter. 09:21That is an AI worth spreading. 09:24Thank you. 09:25(Applause)Footnotes toptop 00:54 BackBackNote“Siri is the thing that knows your intent and helps you do it.” Siri is the world’s most popular intelligent assistant. Learn more about how Siri can help you get the most out of your day. 02:24 BackBackNote“Another example with life-changing consequences is diagnosing cancer.” In one study, human pathologists augmented with AI could produce nearly perfect performance on classifying images of cancer — much better than human or machine acting alone. Dayong Wang, Aditya Khosla, Rishab Gargeya, Humayun Irshad, Andrew H. Beck. Deep Learning for Identifying Metastatic Breast Cancer, arXiv:1606.05718, June 2016. 04:17 BackBackNote“This video by Autodesk is amazing.” This video from Autodesk shows an AI system using design tools to generate thousands of options, allowing the human designer to focus on specifying requirements and evaluating results using uniquely human judgment. See this idea of generative design explored further in a brilliant TED talk by Maurice Conti. 05:27 BackBackNote“Memory is the foundation of human intelligence, but human memory is famously flawed.” Daniel Kahneman’s Thinking Fast and Slow (Macmillan, 2011) is an excellent primer on the cognitive science behind this view. 文章取自https://www.ted.com/talks/tom_gruber_how_ai_can_enhance_our_memory_work_and_social_lives?utm_campaign=tedspread&amp;utm_medium=referral&amp;utm_source=tedcomshare","categories":[],"tags":[{"name":"english ted","slug":"english-ted","permalink":"http://example.com/tags/english-ted/"}]},{"title":"first","slug":"first","date":"2023-03-03T11:35:38.000Z","updated":"2023-03-03T11:40:20.065Z","comments":true,"path":"2023/03/03/first/","link":"","permalink":"http://example.com/2023/03/03/first/","excerpt":"When I was 16 years old, I was getting straight As at my fancy college prep school and feeling great about all the possibilities ahead of me. So one day I walked into the office of my high school guidance counselor, and I told him about all the exciting plans that were coming together in my mind. I told him how I wanted to move to the great city of Chicago, where my brother was living at the time, and start a whole new life. I told him I wanted to go to Northwestern University and build on my strengths in something like biology or piano or psychology. It was all just a path that felt so right to me in my bones.","text":"When I was 16 years old, I was getting straight As at my fancy college prep school and feeling great about all the possibilities ahead of me. So one day I walked into the office of my high school guidance counselor, and I told him about all the exciting plans that were coming together in my mind. I told him how I wanted to move to the great city of Chicago, where my brother was living at the time, and start a whole new life. I told him I wanted to go to Northwestern University and build on my strengths in something like biology or piano or psychology. It was all just a path that felt so right to me in my bones. 00:42 The guidance counselor was this quirky older white gentleman, I remember really well, in response, he looked directly at me and he said, “Well it’s a nice plan, a great school, but it costs a lot of money and they don’t let a lot of people in.” 01:00 And that was pretty much the end of the conversation. I walked out of that office knowing I had a lot of other support in my life, I put the conversation to the side and kept moving forward. But it stuck with me. And I would think about it from time to time over the years and just wonder how that interaction or others like it could really affect someone, especially if they don’t have a lot of other support in their life or they’re not sure what they might be able to do. 01:28 So I kept going, I followed through with my plan. It worked out really well for me. I continued on to grad school in psychology. And eventually I found myself fixated with studying the lives and life paths of young people. And in this work, the problem I’ve come to recognize is that people are constantly made to feel smaller than they might otherwise become by the people and the systems around them. And this really matters because it holds us back from seeing and reaching who we might be. 02:00 My colleagues and I have also found, however, that key messages at critical moments can keep people inspired by possibility. We’ve been conducting experiments for the past 15 years, testing how messages that open possibilities can change people’s lives by expanding their identities, rather than shrinking them. And when I say identities, I mean, all of the ideas that you have about who you are or who you might be. This includes the groups that feel really core to who you are, which we call social identity. Like, your family can be a part of your identity or your race, your ethnicity, your economic status. But identity is more than just all these ideas about who we are right now. It’s also your ideas about who you might become in the future, which we call “future identity.” And all these different parts of identity are constantly being shaped by the environments that you find yourself in, by the things that you go through and by the messages that you take in. These messages can either shrink your identities and make you feel smaller, or they can expand your identities to bring more possibilities within reach for you to then work towards. 03:13 So to make all this as clear as possible, let’s imagine together a specific 11-year-old kid. Let’s give him a name, we can use my brother’s name and call him Reggie. At the age of 11, Reggie’s moving from being a cute little kid to a preteen. He has got good friends, loves his family. And when he gets asked that question people always seem to ask, “What do you want to do when you grow up?” He actually has a pretty solid image coming together in his mind. He is growing up in a modest apartment, but he loves beautiful homes and has an eye for how they’re designed and constructed. And he likes math, so he sees himself becoming an architect and designing homes all over the world. 03:53 At the same time, he’s starting to learn more and more about the barriers in his way to reaching that possible future identity. Everything he’s going to have to accomplish, all of the money it takes to get there. It’s this part that we wanted to tackle in our research. So we’ve run experiments testing how kids like Reggie react or respond to messages that open or close possibilities. How does that change what they imagine for their own future identities and what they actually do. So let’s say, somebody comes into Reggie’s classroom one day with a message to share. And this is just like we do in our experiments. It’s something like, “Yeah, college can cost a lot of money. But there’s this thing out there called need-based financial aid. There are these resources and opportunities to help you get there, tuition can be really lower, even free, if you set yourself up to get to the right places.” 04:47 Our experiments show that getting that message changes how Reggie responds to the question of “What do you see yourself doing later in life?” All of the possibilities that probably require college, like becoming an architect, become bigger in his mind, and he becomes 30 percent more likely to see that for himself and give that type of response compared to if he just gets a message saying, “Here’s the cost of college, end of story.” What’s really interesting on top of that is that the message that opens possibilities does more than just change what Reggie imagines. It changes what he actually does to get there. Our experiments show that after getting that message, he plans to spend twice as much time on homework the following night, and he ends up seven times more likely to actually complete and turn in a real assignment the teacher hands out the very next day. 05:36 So this is all when he’s just 11 years old. So let’s follow this a little bit further to when he’s now 15 years old. He’s in the middle of high school and still really excited about this possibility of architecture in his life because of the messages he’s been getting, opening the possibilities and the things he’s been doing as a result of them. At this age, he’s becoming more and more attuned to what we call different levels of status between him and other people and groups in society who seem to have more stuff, have nicer clothes, more expensive homes. Ultimately, he’s picking up on whose lives and identities seem to be setting them up for all this success that everybody seems to want. 06:17 So what we wanted to know in our studies is how are the messages that he’s getting at this point about his own identities, who he might be now or in the future, changing the extent to which it still feels worth it to keep working towards this long-term goal. 06:33 So let’s say, somebody comes into his high school classroom with a message to share, could be a counselor or a teacher. Again, just like we do in our experiments, but this time it’s a message specifically about his identities. It’s something like, “You may be noticing that there are some people and groups in society who seem to have more money or seem to be better set up to succeed in life. But actually those people and groups that are seen as having less and having to work more for things, they gain some specific advantages because of that experience. That type of social position leads people to develop all sorts of strengths and skills and perspectives and connections that are really key to contributing to school and society.” What we find and replicate in multiple experiments is getting that message that you might be a person with special strengths because of your identity, leads Reggie to feel better about who he is and his chances in life. And this is above and beyond just some general positive “You can do it” type of message. It’s the specific connection between his identity and those strengths that’s especially powerful. 07:42 For example, he starts to reflect and he realizes that he has to work a lot to help to contribute to the family, and he has to take care of his brother all the time while his mom is working late. So he’s become really good at time management and still getting everything done. It’s these types of realizations as a result of the message that lead him to have a significant boost in his self-esteem compared to if he didn’t get that message. 08:04 But it’s not just that empty self-esteem. What’s again interesting is that he becomes more inspired, and he becomes almost 10 percent more likely to continue working and persisting every time he runs into difficulty in a challenging school task or assignment compared to if he didn’t get that message. And that increase in persistence pays off over time, it’s connected to his grades staying high or improving throughout high school, which is very different from the normal trajectory of most students’ grades slowly going down a little bit as high school goes on. 08:37 So that shift keeps his goals within reach for longer. And it takes us to four years later. He’s now 19 years old. He kept going on in school because of these messages building up his identities and the things that he did as a result of them. And he finds himself in this exciting and scary new world of college. He’s feeling a little bit uncertain. As he looks around, he’s hearing other students use words he’s never heard before with confidence, they’re talking about their trips to Europe and all over the world. So he’s really looking for some kind of message about how his identities are seen in this new environment. So let’s say he’s in the dining hall one day early on. He doesn’t know a lot of people yet. So he overhears a group of older students sitting nearby, and they happen to be older students coming from a wide range of backgrounds. And he hears them talking about the financial aid they’re receiving and how they feel supported at the university. He hears some of them saying they realize they’re coming from homes and neighborhoods that aren’t the same as many of the wealthy students who seem to be around. But it’s turning out to help them. They know a little bit more about how to handle the tough situations that come up during college. They know a little bit more about real-world issues and topics. He hears them say they realize they’re bringing more into the classroom because of their identities and where they’re coming from, and that it’s being recognized. Getting that message, hearing from your peers or the institution that your identities are valued leads Reggie to feel like he’s going to figure out how to succeed in his classes and get the most out of college. Our experiments show that getting that message at the right time bolsters him so much that he then engages in college in ways that throughout his first year lead his grades to improve compared to if he didn’t get that message. So much so, that he ends his first year with grades that are just as high as students coming from those wealthy backgrounds and well-known private schools, reducing the disparity between him and those other students by over 60 percent. These are robust effects that we find in experiments where we randomly assign students to receive these messages or not. 10:47 But there’s a wrinkle in all of this. All of these messages, they help so much, they keep somebody seeing and reaching towards tough goals that can pay off in life, but it can take a lot from you to constantly persist and overcome barriers. And as Reggie reaches his dream job at a top architecture firm or in whatever field he discovers along the way, he realizes that he’s feeling kind of stressed all the time. He’s even getting physically ill a little bit more often. This is because to make it this far, he’s had to be extraordinarily vigilant and persistent. He’s had to overcome barriers in schools and workplaces that aren’t designed for people without a lot of family wealth. He’s had to deal with constant experiences of prejudice and discrimination in settings that aren’t used to seeing someone like him succeed. We published a review of dozens of academic articles and empirical studies showing that this type of experience takes a toll on the physical health of people like Reggie and leads him to have an increase in levels of inflammation in the body, which is normally a natural response to something like a threat from a virus. But it becomes harmful and over time leads him to have an increased risk of heart disease, cancer, chronic long-term illness compared to if he weren’t striving in this way. So in the end, is it even all worth it? 12:09 Well, I do think that it is, because our experiments, in collaboration with health research labs show that there are ways for him to work towards these goals and maintain his health at the same time. Let’s go back to when he’s in college, overhearing that group of students talking. And say he actually is able to jump over to connect and make that new group of friends. Or he’s able to join some community or organization, like many that we work on, that’s established to help him form deep and meaningful bonds with people who may have some shared identities and experiences and backgrounds that they explore together. Or he’s able to also hold on to connections in the places that he calls home with the people that he calls family and with the culture that matters to him. All of these social connections and relationships are essential for physical health. We’ve run experiments in collaboration with health research labs where we randomly assign young people to get a message that encourages them and shows them how to cultivate and maintain these types of relationships while they’re striving for these goals, taking them to new places, compared to a message only focused on achievement. And what we find when we bring these participants back into the lab is that over the course of a year, that increased emphasis on connection and relationships leads to a decrease in inflammation of 25 percent. So by not only expanding his identities but also keeping them connected to close relationships, Reggie is able to find achievement and health at the same time. 13:43 Now my actual brother Reggie had a very different life path than the imaginary 11-year-old kid that we just followed. His life ended when he was struck and killed by a drunk driver almost exactly 10 years ago. He was just a couple of years older than I am now. I really looked up to the life that he was able to build. It was full of joy and community and success, doing what he loved. But he had to find all of that despite not receiving any of these messages we’ve talking about in schools, building up his identities or opening possibilities. I never had the chance to ask him how he felt about all of that. If there were any possibilities he felt like he’d let go of or if it all just seemed harder than it needed to be to find his way. 14:39 What if these schools and systems that we’re in as we’re growing up actually supported everyone’s vision and potential? What if they actually encourage people to see that there is a path to the goals that they’re working towards and that there are ways that the circumstances of their lives, whatever they may be, are setting them up for success as they see it, building up their identities rather than shrinking them. These types of messages can be embedded in the ways that we teach important and challenging topics in areas like science, language, math, the arts, history. They can be central to out-of-school activities, like mentoring programs and enrichment programs. These messages can be backed up by the policies that are necessary to make the financial resources that you need to reach these goals actually available for every kid, without taking on crippling debt. 15:39 In the meantime, as we continue to push for the systemic changes that would be necessary to make these types of messages just feel common, we also each have power as individuals. I’m thinking about you as parents, as coworkers, as leaders, as friends, taking the time to show someone that you see who they are, you see who they could be and that there is a path to the life that they’re imagining for themselves. That message from you could lead someone to hold on to what keeps them going for just one more day. 16:22 Thank you. 16:24 (Applause and cheers) 文章取自https://www.ted.com/talks/mesmin_destin_how_everyday_interactions_shape_your_future?utm_campaign=tedspread&amp;utm_medium=referral&amp;utm_source=tedcomshare","categories":[],"tags":[{"name":"english ted","slug":"english-ted","permalink":"http://example.com/tags/english-ted/"}]},{"title":"线性代数","slug":"线性代数","date":"2023-03-02T10:24:02.000Z","updated":"2023-03-02T10:24:24.589Z","comments":true,"path":"2023/03/02/线性代数/","link":"","permalink":"http://example.com/2023/03/02/%E7%BA%BF%E6%80%A7%E4%BB%A3%E6%95%B0/","excerpt":"线性代数一、什么是线性代数 代数就是从许多事物中抽象出数与运算法则，接着进一步关心运算规律。将算数推广到比数更为抽象的对象（运算规则）上面去。 线性的本质就是因变量与自变量之间始终保持组合形式的一种对应关系。 线性映射就是把向量映射到向量，把线段映射到线段。 如果映射是发生在一个集合的同一个坐标系，线性映射就可被称为线性变换。","text":"线性代数一、什么是线性代数 代数就是从许多事物中抽象出数与运算法则，接着进一步关心运算规律。将算数推广到比数更为抽象的对象（运算规则）上面去。 线性的本质就是因变量与自变量之间始终保持组合形式的一种对应关系。 线性映射就是把向量映射到向量，把线段映射到线段。 如果映射是发生在一个集合的同一个坐标系，线性映射就可被称为线性变换。 二、向量的几何与物理意义 向量内积的几何解释就是一个向量在另一个向量的投影的积，也就是同方向的积。 像多项式一样的向量乘法叫做向量的直积。向量的直积是向量的一种最简单的乘法运算，其结果为张量（向量是一阶张量的一种），也称为向量的张量积。向量的张量积包含了向量的内积和外积的结果。 三、行列式行列式的基本知识 行列式从二元线性方程组中演化而来，用来对方程求解。 把n个不同的元素排成一排，叫做这n个元素的全排列。当某一元素的先后次序不同于标准次序时，就说它构成了逆序。逆序数为奇数的排列叫做奇序列，逆序数为偶数的序列叫做偶序列。 在排列中，将任意两个元素对调，其余的元素不同，这种做出新排列的手续叫做对换。将相邻两个元素对换，叫做相邻对换。 一个序列的任意两个元素对换，排列改变奇偶性。 奇排列兑换成标准排列的兑换次数为奇数，偶排列为偶数。（t为列元素的逆序数）$$\\left| \\begin{matrix} a_{11}&amp; a_{12}&amp; a_{13}\\ a_{21}&amp; a_{22}&amp; a_{23}\\ a_{31}&amp; a_{32}&amp; a_{33}\\\\end{matrix} \\right|$$ $$&#x3D;a_{11}a_{22}a_{33}+a_{12}a_{23}a_{31}+a_{13}a_{21}a_{32}-a_{11}a_{23}a_{32}-a_{12}a_{21}a_{33}-a_{13}a_{22}a_{31}$$ $$&#x3D;\\left( -1 \\right) ^{-t}a_{1p_1}a_{2p_2}a_{3p_3}$$ 行列式的性质： 行列式与它的转置行列式相等。 对换行列式的两行（列），行列式变号。（如果行列式中有完全一样的行或列，则此行列式为0）。——叉积特性 行列式中的某一行列中的所有元素都乘同一数k，等于用数乘此行列式。——平行四边形面积，底翻倍，高不变 若行列式的某一行列的元素都是两数之和，则可分解为两个行列式之和。——面积 在n阶行列式中，把(i,j)元所在的第i行和第j列划去后，留下来的n-1阶行列式叫做**(i,j)元的余子式**。$$代数余子式：A_{ij}&#x3D;\\left( -1 \\right) ^{i+j}M_{ij}$$行列式等于它的任一行（列）的各元素与其对应的代数余子式乘积之和。（n阶行列式可以降为更低一阶的行列式） 行列式的几何意义行列式可以理解为行或者列向量所构成的超平行多面体的有向面积或有向体积。或者针对矩阵A的行列式就是线性变换A下的图形面积或者体积的伸缩因子。 二阶行列式可以看作是由行列式的向量所张成的平行四边形的面积，或者理解为两个行向量或者列向量的叉积的数值。 ······ 四、矩阵及其运算","categories":[],"tags":[{"name":"学习","slug":"学习","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0/"}]},{"title":"计算机网络","slug":"计算机网络","date":"2023-03-01T04:39:10.000Z","updated":"2023-03-13T11:33:52.383Z","comments":true,"path":"2023/03/01/计算机网络/","link":"","permalink":"http://example.com/2023/03/01/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C/","excerpt":"计算机网络（10%） 一、概述互联网的组成 边缘部分：由所有连接在互联网上的主机组成，用户直接使用。 边缘端系统之间的通信方式： 客户-服务器方式（C&#x2F;S方式） 对等连接方式（P2P方式） 核心部分：由大量网络和连接这些网络的路由器组成，为边缘部分提供服务。 在网络核心部分起特殊作用的是路由器，用于实现分组交换，其任务为转发收到的分组。 交换就是按照某种方式动态地分配传输线路的资源。 通常我们将发送的整块报文称为一个报文。加上必要的控制信息（首部），就构成了分组，又称“包”、“包头”。","text":"计算机网络（10%） 一、概述互联网的组成 边缘部分：由所有连接在互联网上的主机组成，用户直接使用。 边缘端系统之间的通信方式： 客户-服务器方式（C&#x2F;S方式） 对等连接方式（P2P方式） 核心部分：由大量网络和连接这些网络的路由器组成，为边缘部分提供服务。 在网络核心部分起特殊作用的是路由器，用于实现分组交换，其任务为转发收到的分组。 交换就是按照某种方式动态地分配传输线路的资源。 通常我们将发送的整块报文称为一个报文。加上必要的控制信息（首部），就构成了分组，又称“包”、“包头”。 电路交换 “建立连接”——“通话”——“释放连接” 特点为：在通话的全部时间内，童话的两个用户始终占用端到端的通信资源。 线路的传输效率往往很低。 报文交换 ​ 整个报文先传送到相邻节点，全部储存下来之后查找转发表，转发到下一个节点。 分组交换 ​ 单个分组（整个报文的一部分）传输到相临节点，储存下来查找转发表，转发到下一个节点。 ​ 储存分组技术 互联网的分类与性能 广域网（WAN） 城域网（MAN） 局域网（LAN） 个人局域网（PAN） 接入网AN（用来把用户接入到互联网中） 速率 数据的传送速率 带宽 网络中某通道传送数据的能力，信道所能通过的“最高数据率”。 吞吐量 单位时间内通过某个网络的实际数据量。 时延 数据从网络的一端传送到另一端所需的时间。 发送时延 传播时延 处理时延 排队时延 时延带宽积 时延带宽积 &#x3D; 传播时延 * 带宽 往返时间 利用率 计算机网络体系结构为进行网络中的数据交换而建立起的规则、标准或约定称为网络协议。主要有语法、语义、同步三个要素。 计算机网络的各层及其协议的协议的集合就是网络的体系结构。 应用层 任务：通过应用进程间的交互来完成特定网络应用 定义：应用进程间通信与交互的规则 报文：应用层交互的数据单元称为报文 运输层 任务：负责向两台主机中进程之间的通信提供通用的数据传输服务 协议：传输控制协议TCP（提供面向连接的、可靠的数据出传输服务，数据传输的单位是报文段）、用户数据报协议UDP（提供无连接的尽最大努力的数据传输服务，不保证可靠性，数据传输的单位为用户数据报） 网络层 任务：负责为分组交换网上的不同主机提供通信服务 网络层使用IP协议，分组也称为IP数据报。 互联网是由大量的异构网络通过路由器相互连接起来的。互联网之中使用的网络层协议是无连接的网际协议IP和许多路由选择协议。 数据链路层 数据链路层将网络层交下来的IP数据报组装成帧，在两个相邻节点间的链路上传送帧。数据链路层会检错而且要纠错。 物理层 传输的数据单位为比特。 ​ OSI参考模型将对等层次之间传送的数据单位称为该层的协议数据单元PDU。 实体：任何可以发送或者接收信息的硬件或者软件进程。 协议：控制两个对等实体（或多个实体）进行通信的规则的集合。 协议是“水平的”，但服务是“垂直的”。联通各上下层次之间的为interface（接口）。 在同一个系统中相邻两层的实体进行交互的地方通常称为服务访问点（SAP）。 OSI把层与层之间交换的数据的单元称为服务数据单元SDU。 网络协议即协议，是为进行网络中的数据交换而建立的规则。计算机网络中的各层即协议的集合，称为网络的体系结构。 二、物理层三、数据链路层数据链路层主要使用的信道由两种： 点对点信道 广播信道（专用的共享信道协议） 链路与数据链路： 链路：从一个节点到相邻节点的一段物理线路。 数据链路：物理线路加上必要的通信协议（网络适配器来实现）来控制数据的传输。 数据链路层三个基本问题： 封装成帧 数据部分加上首部和尾部就是帧，首部尾部的作用为进行帧界定和控制信息。数据部分长度上限——最大传送单元MTU。 当数据为可打印的ASCII码时，帧定界可以使用特殊的帧界定符。控制字符SOH放在帧的最前面，EOT表示帧的结束。 透明传输 数据部分不会出现控制字符的信息以致被误致结束，造成数据的错误。 在数据中的出现的控制信息前加入转义字符“ESC”。——字符填充或字节填充 差错检测 0、1可能会发生改变，发生比特差错。误码率BER，数据链路层广泛采取——循环冗余检验CRC的检错技术。 CRC运算就是在数据M的后面添加供差错检测用的n位冗余码，然后构成一个帧发出去。 冗余码可以通过二进制的模二运算，在M后面加上n个0，得到的数除以商定的长度为（n+1）的除数P，得到的余数Q就作为冗余码——帧检验序列FCS。接收端将接收到的数据每一帧都除以相同的除数P，余数R为0，保留，否则丢弃。 更复杂的传输差错：帧丢失、帧重复、帧失序。 无比特差错和无传输差错（可靠传输）不同。数据链路层向上层提供可靠传输，在CRC检错的基础之上增加了帧编号、确认、重传机制。 点对点协议PPP PPP协议的要求：简单、封装成帧、透明性、多种网络协议、多种类型链路、差错检测、检测连接状态、最大传输单元、网络层地址协商、数据压缩协商 PPP协议的组成 一个将IP数据报封装到串行链路的方法 一个用来建立、配置和测试数据链路连接的链路控制协议LCP 一套网络控制协议NCP PPP协议的帧格式 字节填充 零比特填充 PPP协议的工作状态 MAC地址每个网卡或三层网口都有一个MAC地址，也称为硬件地址。MAC地址作为数据链路设备的地址标识符，需要保证网络中的每个MAC地址都是唯一的，才能正确识别。 MAC地址由6个字节组成。前3个字节表示厂商识别码，每个网卡产商都有特定唯一的识别数字，后3个字节由厂商给每个网卡进行分配。 以太网当今常用的以太网协议时ethernet 2标准，其标准定义的数据帧格式为： 前导码（Preamble） 前导码由7个字节组成，每个字节固定为10101010，之后的1个字节称为帧起始定界符，固定为10101011。这8个字节表示以太网帧的开始，也是对端网卡能够确保与其同步的标志。帧起始定界符的最后两位比特被定义为11，之后就是以太网数据帧的本体。 目的地址（Destination Address） 源地址（Source Address） 类型（Type） 类型字段由2个字节组成。类型类型是表明上一层（即网络层）的协议类型，可以让接受方使用相同的协议进行数据帧的解封装。 数据（Data） 一个数据帧所能容纳的最大数据范围是46-1500个字节，不足则补足。 FCS（Frame Check Sequence） 用于检查帧是否有所损坏。 交换机二层转发交换机有多个网络端口，它通过识别数据帧的目标MAC地址，根据MAC地址表确定从哪个端口发送数据。交换机会不断更新、老化和删除。可以通过手动添加静态条目，会被一直保存。 交换机在MAC地址表没找到——泛洪出去 交换机找到MAC地址表，从对应端口单播转发出去，其他设备接收不到——单播 交换机找到的对应端口就是接受到这个数据帧的端口，数据会被丢弃——丢弃 VLAN（虚拟局域网）同属一个VLAN的主机通过二层直接通信，属于不同VLAN的主机只能通过IP路由功能才能实现通信。 VLAN技术通过给数据帧插入VLAN标签（VLAN TAG），让交换机能够分辨各个数据帧所属的VLAN。 TPID（标签协议标识符） 长度两个字节，值为0x8100，表示这个数据帧携带了802.1Q标签。 TCL（标签控制信息） 优先级、CFI（规范格式指示器）、VLAN ID（VLAN 标识符） 无标记帧——Access（接入）接口 标记帧——Trunk（干道）接口 Hybrid接口 Trunk接口发送数据时只会摘掉PVID标签，Hybrid接口能够不携带标签发送多个VLAN数据。 enable //进入特权模型 conf t //进入全局配置 vlan 10 //新建valn 10 name vlan10 //命名为valn10 exit interface fa0/2 //配置接口 port link-type trunk port trunk allow-pass vlan10 exit interface fa0/1 port link-type access port default vlan10 exit switchport mode access switchport access vlan 10 switch mode trunk show vlan exit 四、网络层网络层的主要作用是实现终端节点之间的通信。——点对点通信。 IP地址使用ip地址识别主机和路由器。ip地址是逻辑地址，需要手工配置或自动获取，正常通信中的每个设备必须配置ip地址。 ip地址有32为二进制数组成，分4组。 ip地址由网络号（网段地址）和主机号（主机地址）两部分组成。路由器根据目标IP地址的网络号进行路由。 首尾一般为保留地址，主机号全为时，表示的是网段地址，非主机地址。当主机号全为1时是广播地址，它是向同一个网段中的所有主机发送数据包。D类IP地址没有主机号，用于组播。 单播 广播 组播——将数据包发给特定组内的所有主机。 将子网掩码与IP地址进行与运算可以得到这个IP地址的网段地址。子网掩码用来解决IP地址浪费问题，还有CIDR和VLSM技术来解决。 CIDR （无类域间路由），主机号向网络号借位，采用任意长度分割IP地址的网络号和主机号。 VLSM （可变长子网掩码）网络号向主机号借位。 公网地址与私有地址公网地址是在互联网上使用的，私有地址是在局域网中使用，私有地址可以通过NAT技术将私有地址转换为公网地址接入互联网。","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"人类简史","slug":"人类简史","date":"2023-02-26T09:57:14.000Z","updated":"2023-02-28T13:32:40.105Z","comments":true,"path":"2023/02/26/人类简史/","link":"","permalink":"http://example.com/2023/02/26/%E4%BA%BA%E7%B1%BB%E7%AE%80%E5%8F%B2/","excerpt":"人类简史（半成品） 一、书籍信息 作者: [以色列] 尤瓦尔·赫拉利出版社: 中信出版社出品方: 见识城邦副标题: 从动物到上帝原作名: A brief history of humankind译者: 林俊宏出版年: 2014-11页数: 440定价: 68.00元装帧: 平装ISBN: 9787508647357","text":"人类简史（半成品） 一、书籍信息 作者: [以色列] 尤瓦尔·赫拉利出版社: 中信出版社出品方: 见识城邦副标题: 从动物到上帝原作名: A brief history of humankind译者: 林俊宏出版年: 2014-11页数: 440定价: 68.00元装帧: 平装ISBN: 9787508647357 二、摘抄序 在他看来，正是这种罪恶的人类中心主义，把具有神一般的能力、本来应该成为宇宙间“正能量”的智人，变成了一种不负责任、贪得无厌又极具破坏力的怪兽，结果给地球生态带来了一场“毁天灭地的人类洪水”。 他对智人的所有批评，说到底只是一种“恨铁不成钢”的埋怨，而深藏于其中的，其实还是一种对人类命运的深深忧虑，以及对智人幡然悔悟、痛改前非的殷切期待。 因为一旦人们发现历史能证明乐无常态而知足常乐，发现我们过去对快乐的历史认知可能都是错的，发现对快感的执着追求可能只会适得其反地导致痛苦，那么我们就有可能走向对自己的真正理解，也就可能知道自己想要的究竟是什么了。 人类一种也没特别的动物 智人一直希望自己和其他动物有所不同，仿佛整个科就只有自己的存在，没有兄弟姐妹，没有远近亲戚，而且最重要的是：没有父母。但可惜这绝非事实。 对智人来说，没有其他同属人类的物种，就很容易让人自以为是造物的极致，以为自己和其他整个动物界仿佛隔着一条护城河。 知善恶树（认知革命） 最常见的理论，认为人类语言最为灵活。虽然我们只能发出有限的声音，但组合起来却能产生无限多的句子，各有不同的含义。 第二种理论，也同意人类语言是沟通关于世界的信息的方式。然而，最重要的信息不是关于狮子和野牛，而是关于人类自己。我们的语言发展成了一种八卦的工具。 人类语言真正最独特的功能，并不在于能够传达关于人或狮子的信息，而是能够传达关于一些根本不存在的事物的信息。然而，“虚构”这件事的重点不只在于让人类能够拥有想象，更重要的是可以“一起”想象，编织出种种共同的虚构故事。 无论是现代国家、中世纪的教堂、古老的城市，或者古老的部落，任何大规模人类合作的根基，都在于某种只存在于集体想象中的虚构故事。 集体想象的故事可以突破150人的“八卦”限制，达到共同合作。 多年来，人类已经编织出了一个极其复杂的故事网络。在这个网络中，像标致公司这种虚构的故事不仅存在，而且力量强大。 从认知革命以来，智人一直就生活在一种双重的现实之中。一方面，我们有像是河流、树木和狮子这种确实存在的客观现实；而另一方面，我们也有像是神、国家和企业这种想象中的现实。 自从认知革命之后，智人就能依据不断变化的需求迅速调整行为。这等于开启了一条采用“文化演化”的快速道路，而不再停留在“基因演化”这条总是堵车的道路上。 认知革命正是历史从生物学中脱离而独立存在的起点。 生物学与历史的关系： 基本上，生物学为智人的行为和能力设下了基本限制，像是定出了一个活动范围，而所有的历史都在这个范围之内发生。 然而，这个范围非常大，能让智人有各种惊人的发挥空间。因为他们有创造虚构故事的能力，就能创造出更多、更复杂的游戏，代代相传也就不断发展精进。 因此，想了解智人的行为，就必须描述人类行为的历史演化。光是考虑人类在生物上的限制，就像是今天要去播报一场足球世界杯赛事，只不断报道关于场地的信息，而对球员究竟做了什么只字不提。 亚当和夏娃的一天（认知革命之后、农业革命之前） 演化心理学近来发展蓬勃，认为现在人类的各种社会和心理特征早从农业时代之前就已经开始形塑。 虽然用人类学方式观察现代的采集社会可以帮助我们了解一些远古采集社会的种种可能性，但这绝非全貌，而且可以说绝大多数仍不得而知。 就整体而言，现今人类所知远超过远古人类。但在个人层面上，远古的采集者则是有史以来最具备多样知识和技能的人类。 采集者之所以能够免受饥饿或营养不良的困扰，秘诀就在于多样化的饮食。 正因为这些在农业时代前的采集者有健康和多样化的饮食、相对较短的工作时间，也少有传染病的发生，许多专家将这种社会定义为“最初的富裕社会”。 多数学者都同意，远古的采集者普遍信奉泛神论的信仰。 远古的采集活动生活，对于我们是空白的。在这段时间内，采集社会有着不同的宗教和社会结构，可能有战争与革命，有灵性激昂的宗教运动，有深刻的哲学理论，有无与伦比的艺术杰作。这幅沉默的帷幕就这样罩住了几万年的历史。但我们并不能视而不见，他们事实上也做了很多大事，让地球的生态改头换面。 毁天灭地的人类洪水（认知革命之后） 大约在45000年前的智人发展出了第一个能够航海的人类社会。这给人类的能力及生活形态带来了前所未有的变革。相比于经过长期演化发展出专门的器官和符合流体力学的身形的其他哺乳类生物，人类有着特别的优势。而这也确定了当狩猎采集者首次登上澳大利亚海滩的那一刻，就正式跃居食物链顶端，称为地球上最致命的生物，使得澳大利亚的生态系统发生了翻天覆地的变化。 人类看起来就是个生态的连环杀手。 对这些动物来说，需要靠演化才能学会惧怕人类，但时间根本不够，它们转眼便已灭绝。 智人的第一波殖民正是整个动物界最大也最快速的一场生态浩劫。其中受创最深的是那些大型、毛茸茸的动物。 第一波的灭绝浪潮是由于采集者的扩张，接着第二波灭绝浪潮则是因为农民的扩张； 对全世界上所有的大型动物来说，这场人类洪水的唯一幸存者可能只剩下人类自己，还有其他登上诺亚方舟但只作为人类盘中佳肴的家禽家畜。 史上最大骗局（农业革命）","categories":[],"tags":[{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"}]},{"title":"数字信号处理总结","slug":"数字信号处理总结","date":"2023-02-03T08:07:35.000Z","updated":"2023-02-04T07:26:04.874Z","comments":true,"path":"2023/02/03/数字信号处理总结/","link":"","permalink":"http://example.com/2023/02/03/%E6%95%B0%E5%AD%97%E4%BF%A1%E5%8F%B7%E5%A4%84%E7%90%86%E6%80%BB%E7%BB%93/","excerpt":"","text":"数字信号处理总结 一、 时域离散信号与时域离散系统 线性卷积公式： 序列与冲激序列的卷积： x(n－n0)&#x3D;x(n)*δ(n－n0) 采样定理的重要公式：","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"test_my_site","slug":"test-my-site","date":"2023-01-27T12:37:21.000Z","updated":"2023-01-27T12:39:10.778Z","comments":true,"path":"2023/01/27/test-my-site/","link":"","permalink":"http://example.com/2023/01/27/test-my-site/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"english ted","slug":"english-ted","permalink":"http://example.com/tags/english-ted/"},{"name":"学习","slug":"学习","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0/"},{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"},{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"}]}