{"meta":{"title":"jeacry's world","subtitle":"灵台分寸山，斜月三星洞——寻心之旅","description":"真正的死亡是遗忘！","author":"jeacry","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2023-03-03T07:15:52.000Z","updated":"2023-03-03T07:23:14.835Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"我写博客主要是记录一些自己的日常和学习，记录一下自己的思想经历，希望读越来越多的书，也希望遇见越来越多的人。 内容简陋，仅供自娱自乐，如果冒犯，请联系！ 联系方式：&#106;&#101;&#x61;&#x63;&#x72;&#x79;&#x40;&#116;&#x6f;&#109;&#x2e;&#99;&#111;&#x6d;"},{"title":"tags","date":"2023-03-03T06:59:48.000Z","updated":"2023-03-03T07:12:44.320Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"高数","slug":"高数","date":"2023-07-16T13:43:57.000Z","updated":"2023-07-16T13:45:58.934Z","comments":true,"path":"2023/07/16/高数/","link":"","permalink":"http://example.com/2023/07/16/%E9%AB%98%E6%95%B0/","excerpt":"函数的奇偶性判断 经四则运算之后所得函数的奇偶性 奇偶之和为非奇非偶，奇偶之积为奇。 奇奇之和为奇，奇奇之积为偶。 偶偶之和为偶，偶偶之积为偶。 复合函数的奇偶性 内外函数奇偶性不同则复合函数必为偶函数； 内外函数奇偶性相同，则复合函数与外层函数具有相同的奇偶性。 原函数F(x)的奇偶性 连续奇（偶）函数的一个原函数为偶（奇）函数。","text":"函数的奇偶性判断 经四则运算之后所得函数的奇偶性 奇偶之和为非奇非偶，奇偶之积为奇。 奇奇之和为奇，奇奇之积为偶。 偶偶之和为偶，偶偶之积为偶。 复合函数的奇偶性 内外函数奇偶性不同则复合函数必为偶函数； 内外函数奇偶性相同，则复合函数与外层函数具有相同的奇偶性。 原函数F(x)的奇偶性 连续奇（偶）函数的一个原函数为偶（奇）函数。 函数的有界性和周期性 有限开区间内连续函数的有界性 判定函数在开区间$\\left( a,b \\right) $是否有界，只需检验$\\lim{n\\rightarrow \\text{a}^+}f\\left( x \\right) $和$\\lim{n\\rightarrow \\text{b}^-}f\\left( x \\right) $极限是否存在。 无穷区间内连续函数的有界性 只需检验$\\lim{n\\rightarrow + \\infty}f\\left( x \\right) $和$\\lim{n\\rightarrow - \\infty}f\\left( x \\right) $是否都存在即可。 周期性 满足的条件为：$f\\left( x+T \\right) =f\\left( x \\right)$，其中T为最小正周期。 如果函数$f\\left( x \\right)$的周期为T，则$f\\left( ax+b \\right)$​的周期为$\\frac{T}{\\left| a \\right|}$​。 周期可导函数的导数的周期不变。 极限概念对于任意$\\varepsilon &gt;0$，存在序号N，当$n&gt;N$时，恒有$\\left| x_n-a \\right|&lt;\\varepsilon$成立。 如果函数为无穷大量，则函数必定无解；反之，函数无解时，却不一定是无穷大量。 若$\\lim g\\left( x \\right) =A\\left( A\\ne 0 \\right)$且$\\lim h\\left( x \\right) =\\infty$，则满足$\\lim g\\left( x \\right) h\\left( x \\right) =\\infty$。 有界函数与无穷大量之积不一定为无穷大量。 ==极限的保序性== 若$\\lim{n\\rightarrow x_0}f\\left( x \\right) =A$，$\\lim{n\\rightarrow x_0}g\\left( x \\right) =B$，那么在点$x_0$的某个去心领域（不包含该点$x_0$上），有$f\\left( x \\right) \\le g\\left( x \\right)$，则有$A\\le B$。 若$A&lt;B$,则在点$x_0$的某一个去心领域上必有$f\\left( x \\right) &lt; g\\left( x \\right)$。 使用极限的乘法原理法则必须要满足的是因子的极限必须存在。 数列的发散与收敛的判定可以借助极限相除法，即分子分母的极限都存在，则结果极限存在。 ==复合函数== 若$\\lim_{n\\rightarrow x_0}\\varphi \\left( x \\right) =A$，且$x\\ne x_0$时，$\\varphi \\left( x \\right) \\ne u_0$（此条件不可缺少），令$u=\\varphi \\left( x \\right)$，则内外函数极限可以联系起来。 求未定式极限 用等价无穷小替换之 用变量替换求之 使用带佩亚诺型余项的泰勒公式 使用洛必达法则 通分、分子有理化、变量代换、提取公因式等运算之后，使用洛必达法则。 换底法 求数列极限 公式法、正负项相消、分项法 $1^2+2^2+3^2+…+n^2=\\frac{n\\left( n+1 \\right) \\left( 2n+1 \\right)}{6}$ 夹逼准则 放缩技巧： 若干正数乘积之中，大于1的因子略去则缩小，小于1的因子略去则放大。 分子分母都为正数，分母收缩则放大，分母放大则缩小 n个正数之和可放大为最大数乘n，可缩小为最小数乘n。 n个正数之和也可放大为最大数乘n，缩小为最大数。 定积分的定义 原理为：$\\inta^b{f\\left( x \\right) dx\\rightarrow \\underset{\\lambda \\rightarrow 0}{\\lim}\\sum{i=1}^n{f\\left( \\xi _i \\right) \\varDelta x_i}}$，关键在于找出被积函数及其积分区间。 $\\underset{n\\rightarrow \\infty}{\\lim}\\sum_{i=1}^n{\\frac{1}{n}}f\\left( \\frac{i}{n} \\right) =\\int_0^1{f\\left( x \\right) dx}$ 所给的形式不是积和式，而是乘积式，可以通过求对数的形式化简。 当提不出指定的因子时，结合夹逼准则以及定积分求解。 递推关系式 证明数列单调有界（可以采用数学归纳法），求解极限值。 需要考虑左右极限的函数情况1：含有$\\underset{x\\rightarrow 0}{\\lim}e^{1/x}\\ \\ \\underset{x\\rightarrow \\infty}{\\lim}e^x\\ \\ \\underset{x\\rightarrow \\infty}{\\lim}e^{-x}$的极限 情况2：含有$\\underset{x\\rightarrow 0^+}{\\lim}\\arctan \\left( 1/x \\right) \\ \\ \\underset{x\\rightarrow \\infty}{\\lim}\\arctan x\\ \\ \\underset{x\\rightarrow \\infty}{\\lim}arccot x$和$\\underset{x\\rightarrow 0^-}{\\lim}\\arctan \\left( 1/x \\right)$ 情况3：含有偶（或奇）次根的函数的极限 情况4：分段函数在分段点处的极限 情况5：含有取整函数的函数极限 含参变量的函数极限$\\underset{n\\rightarrow \\infty}{\\lim}\\varphi \\left( n,x \\right)$ $F\\left( x \\right) ^{g\\left( x \\right)}$ $g\\left( x \\right) ^{F\\left( x \\right)}$ 一极限已知求其待定参数或含未知函数的另一极限 无穷小量的阶无穷小量阶的运算法则： 连续与间断点间断点的判断 函数的连续性 连续函数性质： 最值定理 有界性定理 介值定理 零点定理（构造函数、证明实根性）","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"计算机网络总结","slug":"计算机网络总结","date":"2023-07-16T08:07:35.000Z","updated":"2023-07-16T08:15:42.593Z","comments":true,"path":"2023/07/16/计算机网络总结/","link":"","permalink":"http://example.com/2023/07/16/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BD%91%E7%BB%9C%E6%80%BB%E7%BB%93/","excerpt":"计算机网络（5%） 一、概述互联网的组成 边缘部分：由所有连接在互联网上的主机组成，用户直接使用。 边缘端系统之间的通信方式： 客户-服务器方式（C&#x2F;S方式） 对等连接方式（P2P方式） 核心部分：由大量网络和连接这些网络的路由器组成，为边缘部分提供服务。 在网络核心部分起特殊作用的是路由器，用于实现分组交换，其任务为转发收到的分组。 交换就是按照某种方式动态地分配传输线路的资源。 通常我们将发送的整块报文称为一个报文。加上必要的控制信息（首部），就构成了分组，又称“包”、“包头”。","text":"计算机网络（5%） 一、概述互联网的组成 边缘部分：由所有连接在互联网上的主机组成，用户直接使用。 边缘端系统之间的通信方式： 客户-服务器方式（C&#x2F;S方式） 对等连接方式（P2P方式） 核心部分：由大量网络和连接这些网络的路由器组成，为边缘部分提供服务。 在网络核心部分起特殊作用的是路由器，用于实现分组交换，其任务为转发收到的分组。 交换就是按照某种方式动态地分配传输线路的资源。 通常我们将发送的整块报文称为一个报文。加上必要的控制信息（首部），就构成了分组，又称“包”、“包头”。 电路交换 “建立连接”——“通话”——“释放连接” 特点为：在通话的全部时间内，童话的两个用户始终占用端到端的通信资源。 线路的传输效率往往很低。 报文交换 ​ 整个报文先传送到相邻节点，全部储存下来之后查找转发表，转发到下一个节点。 分组交换 ​ 单个分组（整个报文的一部分）传输到相临节点，储存下来查找转发表，转发到下一个节点。 ​ 储存分组技术 互联网的分类与性能 广域网（WAN） 城域网（MAN） 局域网（LAN） 个人局域网（PAN） 接入网AN（用来把用户接入到互联网中） 速率 数据的传送速率 带宽 网络中某通道传送数据的能力，信道所能通过的“最高数据率”。 吞吐量 单位时间内通过某个网络的实际数据量。 时延 数据从网络的一端传送到另一端所需的时间。 发送时延 传播时延 处理时延 排队时延 时延带宽积 时延带宽积 &#x3D; 传播时延 * 带宽 往返时间 利用率 计算机网络体系结构为进行网络中的数据交换而建立起的规则、标准或约定称为网络协议。主要有语法、语义、同步三个要素。 计算机网络的各层及其协议的协议的集合就是网络的体系结构。 应用层 任务：通过应用进程间的交互来完成特定网络应用 定义：应用进程间通信与交互的规则 报文：应用层交互的数据单元称为报文 运输层 任务：负责向两台主机中进程之间的通信提供通用的数据传输服务 协议：传输控制协议TCP（提供面向连接的、可靠的数据出传输服务，数据传输的单位是报文段）、用户数据报协议UDP（提供无连接的尽最大努力的数据传输服务，不保证可靠性，数据传输的单位为用户数据报） 网络层 任务：负责为分组交换网上的不同主机提供通信服务 网络层使用IP协议，分组也称为IP数据报。 互联网是由大量的异构网络通过路由器相互连接起来的。互联网之中使用的网络层协议是无连接的网际协议IP和许多路由选择协议。 数据链路层 数据链路层将网络层交下来的IP数据报组装成帧，在两个相邻节点间的链路上传送帧。数据链路层会检错而且要纠错。 物理层 传输的数据单位为比特。 ​ OSI参考模型将对等层次之间传送的数据单位称为该层的协议数据单元PDU。 实体：任何可以发送或者接收信息的硬件或者软件进程。 协议：控制两个对等实体（或多个实体）进行通信的规则的集合。 协议是“水平的”，但服务是“垂直的”。联通各上下层次之间的为interface（接口）。 在同一个系统中相邻两层的实体进行交互的地方通常称为服务访问点（SAP）。 OSI把层与层之间交换的数据的单元称为服务数据单元SDU。 网络协议即协议，是为进行网络中的数据交换而建立的规则。计算机网络中的各层即协议的集合，称为网络的体系结构。 二、物理层三、数据链路层数据链路层主要使用的信道由两种： 点对点信道 广播信道（专用的共享信道协议） 链路与数据链路： 链路：从一个节点到相邻节点的一段物理线路。 数据链路：物理线路加上必要的通信协议（网络适配器来实现）来控制数据的传输。 数据链路层三个基本问题： 封装成帧 数据部分加上首部和尾部就是帧，首部尾部的作用为进行帧界定和控制信息。数据部分长度上限——最大传送单元MTU。 当数据为可打印的ASCII码时，帧定界可以使用特殊的帧界定符。控制字符SOH放在帧的最前面，EOT表示帧的结束。 透明传输 数据部分不会出现控制字符的信息以致被误致结束，造成数据的错误。 在数据中的出现的控制信息前加入转义字符“ESC”。——字符填充或字节填充 差错检测 0、1可能会发生改变，发生比特差错。误码率BER，数据链路层广泛采取——循环冗余检验CRC的检错技术。 CRC运算就是在数据M的后面添加供差错检测用的n位冗余码，然后构成一个帧发出去。 冗余码可以通过二进制的模二运算，在M后面加上n个0，得到的数除以商定的长度为（n+1）的除数P，得到的余数Q就作为冗余码——帧检验序列FCS。接收端将接收到的数据每一帧都除以相同的除数P，余数R为0，保留，否则丢弃。 更复杂的传输差错：帧丢失、帧重复、帧失序。 无比特差错和无传输差错（可靠传输）不同。数据链路层向上层提供可靠传输，在CRC检错的基础之上增加了帧编号、确认、重传机制。 点对点协议PPP PPP协议的要求：简单、封装成帧、透明性、多种网络协议、多种类型链路、差错检测、检测连接状态、最大传输单元、网络层地址协商、数据压缩协商 PPP协议的组成 一个将IP数据报封装到串行链路的方法 一个用来建立、配置和测试数据链路连接的链路控制协议LCP 一套网络控制协议NCP PPP协议的帧格式 字节填充 零比特填充 PPP协议的工作状态 MAC地址每个网卡或三层网口都有一个MAC地址，也称为硬件地址。MAC地址作为数据链路设备的地址标识符，需要保证网络中的每个MAC地址都是唯一的，才能正确识别。 MAC地址由6个字节组成。前3个字节表示厂商识别码，每个网卡产商都有特定唯一的识别数字，后3个字节由厂商给每个网卡进行分配。 以太网当今常用的以太网协议时ethernet 2标准，其标准定义的数据帧格式为： 前导码（Preamble） 前导码由7个字节组成，每个字节固定为10101010，之后的1个字节称为帧起始定界符，固定为10101011。这8个字节表示以太网帧的开始，也是对端网卡能够确保与其同步的标志。帧起始定界符的最后两位比特被定义为11，之后就是以太网数据帧的本体。 目的地址（Destination Address） 源地址（Source Address） 类型（Type） 类型字段由2个字节组成。类型类型是表明上一层（即网络层）的协议类型，可以让接受方使用相同的协议进行数据帧的解封装。 数据（Data） 一个数据帧所能容纳的最大数据范围是46-1500个字节，不足则补足。 FCS（Frame Check Sequence） 用于检查帧是否有所损坏。 交换机二层转发交换机有多个网络端口，它通过识别数据帧的目标MAC地址，根据MAC地址表确定从哪个端口发送数据。交换机会不断更新、老化和删除。可以通过手动添加静态条目，会被一直保存。 交换机在MAC地址表没找到——泛洪出去 交换机找到MAC地址表，从对应端口单播转发出去，其他设备接收不到——单播 交换机找到的对应端口就是接受到这个数据帧的端口，数据会被丢弃——丢弃 VLAN（虚拟局域网）同属一个VLAN的主机通过二层直接通信，属于不同VLAN的主机只能通过IP路由功能才能实现通信。 VLAN技术通过给数据帧插入VLAN标签（VLAN TAG），让交换机能够分辨各个数据帧所属的VLAN。 TPID（标签协议标识符） 长度两个字节，值为0x8100，表示这个数据帧携带了802.1Q标签。 TCL（标签控制信息） 优先级、CFI（规范格式指示器）、VLAN ID（VLAN 标识符） 无标记帧——Access（接入）接口 标记帧——Trunk（干道）接口 Hybrid接口 Trunk接口发送数据时只会摘掉PVID标签，Hybrid接口能够不携带标签发送多个VLAN数据。 enable //进入特权模型 conf t //进入全局配置 vlan 10 //新建valn 10 name vlan10 //命名为valn10 exit interface fa0/2 //配置接口 port link-type trunk port trunk allow-pass vlan10 exit interface fa0/1 port link-type access port default vlan10 exit switchport mode access switchport access vlan 10 switch mode trunk show vlan exit 四、网络层网络层的主要作用是实现终端节点之间的通信。——点对点通信。 IP地址使用ip地址识别主机和路由器。ip地址是逻辑地址，需要手工配置或自动获取，正常通信中的每个设备必须配置ip地址。 ip地址有32为二进制数组成，分4组。 ip地址由网络号（网段地址）和主机号（主机地址）两部分组成。路由器根据目标IP地址的网络号进行路由。 首尾一般为保留地址，主机号全为时，表示的是网段地址，非主机地址。当主机号全为1时是广播地址，它是向同一个网段中的所有主机发送数据包。D类IP地址没有主机号，用于组播。 单播 广播 组播——将数据包发给特定组内的所有主机。 将子网掩码与IP地址进行与运算可以得到这个IP地址的网段地址。子网掩码用来解决IP地址浪费问题，还有CIDR和VLSM技术来解决。 CIDR （无类域间路由），主机号向网络号借位，采用任意长度分割IP地址的网络号和主机号。 VLSM （可变长子网掩码）网络号向主机号借位。 公网地址与私有地址公网地址是在互联网上使用的，私有地址是在局域网中使用，私有地址可以通过NAT技术将私有地址转换为公网地址接入互联网。 IP路由路由表记录着IP数据在下一跳应该发给那一个路由器。 路由表的生成方式有两种：静态路由（手动设置）和动态路由（路由器之间交换信息自动刷新）。 跳——指的是网络中的一个区间，一跳是指数据链路中广播域的区间，也就是说不经过路由器而能直接到达的相连主机或者路由器网卡的一个区间。 默认路由是指路由表中的任何一个地址都能与之匹配的条目，所有数据包都可以使用默认路由进行数据转发。 默认路由为0.0.0.0&#x2F;0或default 主机路由 IP地址&#x2F;32？回环地址：以127开头的IP地址都是环回地址。 IP分片与重组每种数据链路的最大传输单元（MTU）不同，网络层的IP是数据链路的上一层，IP通过分片屏蔽数据链路的差异。 当遇到IP数据包大于数据链路MTU时，主机或者路由器就会对IP数据包进行分片处理。之后只会在目标主机进行重组。 路径MTU发现发现路径中存在的所有数据链路中的最小的MTU，避免在中途的路由器上进行分片处理。 路由器三层转发原理 解封装 查找匹配的路由条目 选择匹配中的最长的路由条目（最长匹配原则） 转发（路由条目中包含下一条和出接口） ARP（地址解析协议）实际通信中还需知道每一个IP地址所对应的MAC地址。 同一网段内 ARP请求：同网段内广播 ARP响应 更新ARP缓存表 不同网段时 默认网关（建立与默认网关之间的传输，更新双方MAC地址） 将数据发送给默认网关 路由器与目的主机建立联系 路由器发送数据给目的地 ARP代理 免费ARP（特殊的ARP请求，启动主机之后自发，目标IP时自己的IP地址） ICMP（互联网控制消息协议）确认IP包是否成功送达目的地址，通知发送过程中IP包被丢弃的原因。 ICMP头部封装字段 类型（8比特） 编码（8比特） 校验和（16比特） 从功能上ICMP分为： 通知出错原因的错误消息 用于诊断的查询消息 路由协议NAT（过渡技术）NAT用于解决IPv4地址不够用的问题。——将私有地址转换为公网地址，使私有网络中的主机可以通过少量公网地址访问互联网。","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"光纤通信总结","slug":"光纤通信总结","date":"2023-07-16T08:07:35.000Z","updated":"2023-07-16T09:25:49.701Z","comments":true,"path":"2023/07/16/光纤通信总结/","link":"","permalink":"http://example.com/2023/07/16/%E5%85%89%E7%BA%A4%E9%80%9A%E4%BF%A1%E6%80%BB%E7%BB%93/","excerpt":"一、光纤通信介绍1、光纤通信优缺点 光纤通信最大的特点就是大容量长距离传输。 优点： 容许频带很宽，传输容量大 损耗很小，误码率小传输距离长 电磁兼容性好和环境兼容性好 线径轻，体积小，可绕性好 资源丰富等","text":"一、光纤通信介绍1、光纤通信优缺点 光纤通信最大的特点就是大容量长距离传输。 优点： 容许频带很宽，传输容量大 损耗很小，误码率小传输距离长 电磁兼容性好和环境兼容性好 线径轻，体积小，可绕性好 资源丰富等 缺点： 质的脆 机械强度低 要求较好的切割、连接技术 分路、耦合技术麻烦 2、光纤通信系统基本组成 光源是光发射机的核心。把电信号转变为光信号，有直接调制和间接调制两种调制方案。 光纤线路包括光纤、光纤接头和光纤连接器。对光线的基本要求为损耗和色散两个传输特性。 光检测器是光接收机的核心。检测方式有直接检测和外差检测两种。最重要的特性传输为灵敏度。 光纤三个低损耗窗口：0.85微米、1.31微米和1.55微米。 二、光纤和光缆1、光纤介绍光纤是由中心的纤芯和外围的包层同轴组成的圆柱形细丝。纤芯的折射率（n1）比包层（n2）稍高，损耗更低。 纤芯作用：传输主要的光能量（n1&gt;n2）。 包层作用：为光的传输提供反射面和光隔离，并起一定的机械保护作用。 相对折射率差——越大，把光能量束缚在纤芯的能量越强，但信息传输容量却越小。 \\varDelta =\\left( n_1-n_2 \\right) /n_1\\text{（一般）}=\\left( n_{1}^{2}-n_{2}^{2} \\right) /2n_{1}^{2}\\text{（通用）}2、光纤分类 利用材料分类 石英系 多组份玻璃纤维光纤 塑料包层光纤 全塑光纤（损耗大） 折射率分布 均匀光纤（折射率不变） 非均匀光纤（纤芯折射率变化，包层不变） 传输总模数 模数（在光纤中能够存在的分布形式） 多模：50-80微米 频带窄、容量小、低速 单模：直径8-10微米 ITU-T工程分类 特种单模光纤 双包层光纤（M型）——常规光纤在1.31微米处色散为0，色散平坦则会延后并保持一定的低色散，色散移位将零色散点移位至1.51微米。 色散平坦 色散移位 三角层 ——改进色散移位光纤，在1.55微米处加入微量色散以抵消似波会频效应。 椭圆芯——双折射特性，可以保持偏振状态。 通信用光线分类 突变型多模光纤（SIF） 渐变型多模光纤（GIF） 单模光纤（SMF） 3、光纤传输理论 几何光学理论 空间分布——数值孔径 时间分布——时间延迟 突变型多模光纤 NA=n_0\\sin \\theta _c=\\sqrt{n_{1}^{2}-n_{2}^{2}}\\approx n_1\\sqrt{2\\varDelta}\\varDelta \\tau =\\frac{L}{2n_1c}\\theta _{c}^{2}=\\frac{L}{2n_1c}\\left( NA \\right) ^2\\approx \\frac{n_1L}{c}\\varDelta 渐变型多模光纤 自聚焦效应：不同入射角相应的光线，虽然经历的路程不同，但是最后都会聚在P点上。幅度的大小却决于入射角。且其时间延迟近似相等，路程长的光纤传播速度快，相互抵消。 波动理论 光纤传输模式的电磁场分布和性质取决于特征参数。 V^2=u^2+w^2\\text{（}u\\text{、}w\\text{、V为引入的无量纲常数）} \\text{（特征参数}u\\text{、}w\\text{、}\\beta \\text{）} 前两个特征参数决定纤芯和包层横向电磁场的分布，为横向传输常数；最后一个决定纵向电磁场分布和传输性质，为（纵向）传输常数。 V=\\frac{2\\pi a}{\\lambda}\\sqrt{n_{1}^{2}-n_{2}^{2}} 模式截止状态指w=0介于传输模式和辐射模式的临界状态。当w&gt;0时，在包层内的电磁场消失；当w&lt;0时，电磁场将在包层中振荡，传输模式将转换为辐射模式。 当v=0时，电磁场分为两类，一类在传输方向上无磁场的模式称为横磁模波；一类在传输方向上没有电场的模式叫做横电模。当v不等于0时，这些模式称为混合模。混合模也分为两类。 模式远离截止 当V趋近于无穷大时，w增长很快，当w趋近于无穷，u只能增加到一个有限值，该状态为模式远离截止。 多模渐变型光纤的模式特性 模式总数的计算 M=\\left( \\frac{g}{g+2} \\right) a^2k^2n_{1}^{2}\\varDelta =\\left( \\frac{g}{g+2} \\right) \\frac{V^2}{2}​ 对于突变型光纤，g趋近于无穷。对于平方律渐变型光纤，g取2。——渐变型光纤中存在模式群，可将部分模式合并。其中g为折射率分布指数。 单模光纤的模式特性 单模条件：—临界波长 V=2.045\\frac{\\lambda _c}{\\lambda}\\le 2.405当两个偏振模应外力其他条件改变传输常数之后,会引起偏振态的变化,会有双折射,产生偏振色散.解决的办法为人为引入强双折射抵消或者实现单模单偏振传输。 4、光纤传输特性传输后的信号不仅幅度要减小，波形也要展宽。产生信号的畸变的原因主要是光纤中存在色散。色散和损耗是光纤中最重要的传输特性。损耗限制系统的传输距离，色散则限制系统的传输带宽。 光纤色散色散是在光纤中传输的光信号，由于不同成分的光的传输时间不同而产生的一种物理效应。 模式色散 不同模式的传播时间不同。 材料色散 由于光纤的折射率随波长而改变，以及模式内部不同波长成分的光传播时间不同产生。 波导色散 波导结构参数与波长有关而产生的。 色散在频域里限制了传输信号的带宽，在时域里引起信号的展宽。色散通常用3dB的光带宽或者脉冲展宽表示。 多模光纤色散 均方根脉冲展宽随光源谱宽的增大而增大，并在很大程度上取决折射率分布指数g。当g=g0，均方根脉冲展宽取最小值。g的最佳值为2+e。 单模光纤色散 理想单模光纤没有模式色散，只有色度色散（材料色散和波导色散），是传播时间随波长变化产生的结果。 光纤损耗损耗系数为： \\alpha =\\frac{10}{L}\\lg \\frac{P_i}{Po} 吸收损耗 是由二氧化硅材料引起的固有吸收和由杂质引起的吸收产生的。包括杂质吸收、红外吸收和紫外吸收。 在氢氧负离子吸收峰两侧1.31微米和1.55微米存在两个损耗很小的波长“窗口”。 散射损耗 主要由材料微观密度不均匀引起的瑞利散射和由光纤结构缺陷（如气泡）引起的散射产生的。 光纤标准和应用 ITU-T编号 名称 特点 应用 G.651 多模渐变型光纤（GIF） 无 中小容量、中短距离的通信系统 G.652 常规单模光纤 在波长1.31微米处色散为零，系统只受损耗的影响在零色散点的损耗不是最小值。 要实现长距离通信要利用电光、光电中继。 G.653 色散移位光纤 在波长为1.55微米处色散为0，损耗也最小。 大距离长距离通信 G.654 1.55微米损耗最小的单模光纤 1.31微米处色散为0，1.55微米处损耗比常规更低 改进用于增加传输距离。 色散补偿光纤 1.55微米处具有大的负色散。 和常规单模光纤在1.55处的正色散抵消，达到零色散和损耗最低的效果。 G.655 非零色散光线 5、光缆对光缆的基本要求是保护光纤的机械强度和传输特性。 保护光纤固有机械强度的方法采用塑料被覆和应力筛选。光线从高温中拉出后立即用软塑料进行一次被覆和应力筛选，除去断裂光纤，利用硬塑料进行二次被覆。 6、光线特性测量三、光器件1、光源光源是光发射机的重要器件，作用为把电信号转换为光信号。 光与物质相互作用的基本形式： 受激辐射、受激吸收、自发辐射。 半导体激光二极管或称激光器（LD） 半导体激光器是向半导体PN结注入电流，实现粒子数反转分布，产生受激辐射，再利用谐振腔的正反馈，实现光发大而产生激光振荡的。[[专业课学习/光纤通信/PN结 粒子数反转 光电效应]] 粒子数分布反转是产生受激辐射的必要条件，谐振腔可以对光的频率和方向进行选择。 半导体激光器的基本结构为双异质结（DH）平面条形结构。 主要特性： 发射波长近似取决于禁带宽度。 激光器的电光转换效率用外微分量子效率表示，定义为在阈值电流以上，每对复合载流子产生的光电子数。 激光器的输出光功率随温度而变化的两个原因：激光器的阈值电流随温度的升高而增大；外微分量子效率随温度的升高而减小。 分布反馈激光器（DFB-LD） 利用靠近有源层沿长度方向制作的周期性结构衍射光栅实现光反馈。 发光二极管或称发光管（LED）LED发射的是自发辐射光。LED不需要光学谐振腔，没有阈值。包括正面发光型和侧面发光型，输出功率较小，光谱宽度宽，调制频率较低。 2、光发射机数字光发射机的功能是把电端机输出的数字基带信号转换为光信号，并用耦合技术有效注入·光纤线路，电光转化使用承载信息的数字信号对光源进行调制来实现的。调制方式分为直接调制和外调制两种。受调制的光源特性参数有功率、幅度、频率和相位。 光发射机的基本组成： 光源 调制电路和控制电路 要求：消光比 消光比为全“0”码平均功率与全“1”码平均功率的比值。 线路编码电路 均衡[[专业课学习/通信原理/2均衡]]消除码间干扰 调制特性 电光延迟和驰张震荡 输出光脉冲和注入光脉冲之间存在一个初始延迟时间——电光延迟时间，当电流注入激光器之后，输出光脉冲会出现幅度逐渐衰减的振荡——驰张震荡。 这些特性和激活器有源区的电子自发复合寿命和谐振腔内光子寿命以及注入电流初始偏差量有关。 驰张震荡与电光延迟的后果是限制调制速率，一般最高调制频率低于驰张震荡频率。 电光延迟要造成码型效应。在输入脉冲序列中有较多连“0”码后出现的“1”码，其脉冲会明显变小，而且连“0”数越多，调制速率越高，这种效应越明显，会出现“1”码丢失。采用适当的“过调制”补偿方法，可以消除码型效应。 增加注入电流，有利于提高驰张震荡频率，减小其幅度衰减时间，以及减小电光延迟时间，因此对LD光源施加偏置电流是有用的。 自脉动现象 某些激光器在脉冲调制甚至直流驱动下，当注入电流达到某个范围时，输出光脉冲会出现持续等幅的高频振荡——自脉动效应。 产生原因：激光器内部不均匀增益或不均匀吸收产生的。 在选择激光器的时候选择线性较好的。 调制电路和自动功率控制 数字信号调制电路最常用的是差分电流开关电路。 温度特性和自动温度控制 温度对激光器的主要影响主要通过阈值电流和外微分量子效率产生。温度对于输出光脉冲的另一个影响是“结发热效应”。调制电流引起激光器结区温度的变化使得输出光脉冲的形状发生变化。“结发热效应”将引起调制失真。低调制速率的“结发热效应”会更明显。 3、光检测器常用的光检测器有PIN光电二极管和雪崩光电二极管（APD）。 光电二极管实现电光转化的功能是由半导体PN结的光电效应实现的。 光生电流包括光生漂移电流和光生扩散电流。光电二极管通常要施加适当的反向偏压，增加耗尽层的宽度，缩小中性区的宽度。 PIN光电二极管 在PN结中间设置一层参杂浓度很低的本征半导体。 光电效率用量子效率或者响应度表示。 响应时间 噪声——直接影响光接收机的灵敏度。 波长响应范围 APD光电二极管 击穿电压特性（大的反向偏压）使载流子雪崩式倍增。 倍增因子——描述放大作用。 过剩噪声因子 4、光接收机数字光接收机的基本功能是把经光纤传输后幅度被衰减、波形被展宽的微弱光信号转换为电信号，并放大处理，恢复为原始的数子码流。 主要的性能指标为灵敏度和动态范围。 噪声特性 误码率超扰比 灵敏度 衡量光接收机性能的综合指标，在保证通信质量（限定误码率或者信噪比）的条件下，光接收机所需的最小平均接受光功率。 P_r=10\\lg \\left[ \\frac{\\left< P \\right> _{\\min}\\left( W \\right)}{10^{-3}} \\right] \\left( dBm \\right)在限定误码率条件下，决定光接收机灵敏度的主要因素是传输速率和光检测器、前置放大器的特性，特别是噪声特性。 自动增益与动态范围主放大器的另一个功能是实现自动功率控制（AGC），使得光接收机的入射光变化时输出电流基本恒定。动态范围（DR）的定义是：在限定误码率的条件下，光接收机所能承载的最大平均接受光功率与所需的最小平均接受光功率的比值。 5、无源器件 连接器与接头 光耦合器 功能：把一个输入的光信号分配给多个输出，或者把多个输入的光信号组合成一个输出。对光纤线路的影响主要是附加插入损耗，还有一定的反射和串扰。 类型： T型耦合器 星型耦合器 定向耦合器 波分复用器、解复用器 基本结构： 光线型——把两根或多根光纤排列，用熔拉双锥技术制作各种器件。 微器件 ——用自聚焦透镜和分光片（光部分透射，部分反射）、滤光片（一个波长的光透射，另一个波长的反射）或光栅（不同波长的光有不同的反射方向）等微光学器件。 波导型 在一片平板衬底上制作所需形状的光波导，衬底作支撑体，又称波导包层。 光隔离器和光环行器 隔离器是一种非互易器件，只允许光波往一个方向上传输，组织光波往其他方向传输特别是反方向传输。 主要参数： 插入损耗 隔离度 隔离器的工作原理：单模传输中的光的偏振态是在垂直于传输方向上平面上电场矢量的方向。任意时刻电场矢量都可以分解为两个正交分量。法拉第旋转器为旋光材料制成，能使得光的偏振态旋转一定角度。 光调制器 调制器可以用光电效应、磁光效应或者声光效应来实现。 光开关 机械类开关——利用电磁铁或步进电机驱动光纤等实现电路转换。 固体光开关——利用磁光效应、电光效应或者声光效应实现光路转换。 6、线路编码扰码[[专业课学习/光纤通信/信道编码——扰码]]：关于扰码的Verilog的仿真 mBnB码插入码四、数字光纤系统1、两种传输体制 准同步传输体制PDH ——适用于中、低速率点对点的传输，采用异步复用方式。 E1速率——2.048Mb/s（一次基群）中国、欧洲以及国际间连接采用 高次基群的话路数是低次基群的4的n次方倍。 T1速率——1.544Mb/s（一次基群） 同步传输体制SDH[[专业课学习/补充知识/SDH体系]] 传输速率 采用世界上统一的传输速率，也就是最基本的模块称为STM-1，传输速率为155.520Mb/s； 帧结构——以一定规律的组成块状帧结构。 这样的每帧共有9x270xN个字节，每个字节8比特，每秒传送8000帧，对于STM-1而言，传输速率为9x270x8 x8000=155.520Mbps，字节发送顺序为：由上往下逐行发送，每行先左后右。 SDH帧大体分为三个部分： 段开销（SOH）保证信息正常传输的附加字节，用于运行维护管理。段开销又分为再生子段开销（SOH）和复接子段开销（LOH）。前者占据前3行，后者占5-9行。 信息载荷（Payload）是SDH帧中用于承载各种业务信息的部分。在payload中有少量的字节用于通道的运行维护和管理。这些字节被称为通道开销（POH）。 管理单元指针（AU-PTR）一种指示符，主要用于指示payload第一个字节在帧内的准确位置。 复用原理 将低路支路信号复接为高速信号主要有两种传统方式：正码速调整法、固定位置换射法。 载荷指针技术：映射（把支路信号适配装入虚容器的过程）——定位（管理单元指针AUPTR）——复用 PDH与SDH的优缺点比较 PDH：没有统一的光、电接口标准，高速信号帧结构的位置没有规律性和固定性，帧结构中用于维护工作（OAM）的开销字节不多，没有统一的网关接口。 SDH：网络节点接口作了统一规范，可以横向兼容。有严格的标准规范，有利于建成世界上统一的通信网络。帧结构中有丰富的比特开销，不必进行码速调整，简化了实现的设备。但频带利用率低，指针调整机理复杂，软件大量使用，安全性保证。 SDH的应用 点对点传输、链性网和环形网。 SDH环形网的一个突出特点是具有自愈能力，当某节点发生故障或者光缆中断时，仍能维持一定的通信能力。 2、系统性能指标数字传输参考模型——假设参考模型（HRX）。最长的数字参考模型HRX为17500km，它由各级交换中心和许多假设参考数字链路（HRDL）组成。假设参考链路由许多的假设参考字段（HRDS）组成。 我国用于长途传输的HRDS长度为420km（一级干线）和280km（二级干线）。 假设参考数字段的性能指标从假设参考链路的指标分配中得到，并再度分配给线路和设备。 误码率（BER）衡量传输系统的传输质量优劣的重要指标。 误码率参数： 误码率参数 定义 指标 长期平均误码率 劣化分（DM） BER劣于10^-6的分数 &lt;10% &lt; 6.2✖10^-7 严重误码秒（SES） BER劣于10^-3的分数 &lt;0.2% &lt; 3✖10^-5 误码秒（ES） BER不为0的秒数 &lt;8% &lt; 1.3✖10^-6 严重误码秒用于检测突发性、集群性的误码出现。 抖动——数字信号传输过程中产生的一种瞬时不稳定现象。数字信号在各有效瞬时时对标准时间位置的偏差，偏差时间称为抖动幅度。 可靠性——一般采用故障统计分析法。 3、系统的设计系统设计的主要问题是确定中继距离。 中继距离受到损耗的限制 L=\\frac{P_t-P_r-2\\alpha _c-M_e}{\\alpha _f+\\alpha _s+\\alpha _m} 中继距离受色散的限制 L=\\frac{0.226\\times 10^6}{f_b\\left| C_0 \\right|\\sigma _{\\lambda}}\\left( \\text{理论} \\right) L=\\frac{\\varepsilon \\times 10^6}{F_b\\left| C_0 \\right|\\sigma _{\\lambda}}\\left( \\text{实际} \\right) 确定中继距离——选择较短的距离，作为最后的结果。 五、模拟光纤通信系统1、调制方式主要的调制方式有三种： 模拟基带直接光强调制（D-IM） 利用承载信号的模拟基带信号，直接对发射机光源进行光强调制，使光源输出光功率随时间变化的波形和输入模拟基带信号的波形成比例。 优点：设备简单、价格低廉；缺点：需要补偿、接收灵敏度低。 模拟间接光强调制 先用承载信息的模拟基带信号进行电的预调制 ，然后用这个预调制的信号对光源进行光强调制（IM）。 频率调制（FM） 模拟基带信号对正弦载波进行调频，产生等幅的频率受调的正弦信号，频率随基带信号的瞬时值而变化，接着进行光强调制，形成FM-IM光纤传输系统。 脉冲频率调制（PFM）模拟基带信号对脉冲载波进行调频，产生等幅、等宽的频率受调的脉冲信号，频率随基带信号的瞬时值而变化，接着进行光强调制，形成PFM-IM光纤传输系统。 方波频率调制（SWFM）模拟基带信号对方波进行调频，产生等幅、不等宽的方波脉冲调制信号，频率随基带信号的幅度而变化，接着进行光强调制，形成SWFM-IM光纤传输系统。 间接光强调制的目的是提高传输质量和增加传输距离。 频分复用光强调制 每路模拟电视基带信号分别对某个指定的射频（RF）电信号进行调幅（AM）或者调频（FM）。然后用组合器把多个预调RF信号组成多路宽带信号，再将其用作对光发射机光源进行光强调制。传统意义上的载波是光载波，把受基带信号预调制的RF电载波称为副载波。这种复用也称为副载波复用（SCM）。 2、D-IM光纤传输系统 正弦信号直接光强调制系统的信噪比主要受光接受机性能的影响。评价该系统的传输质量的特性参数为信噪比（SNR）和信号失真（信号畸变）。 \\frac{S}{N}=\\frac{\\text{信号功率}}{\\text{噪声功率}}=\\frac{\\text{均方信号电流}}{\\text{均方噪声电流}}和SNR密切相关的一个参数是接收灵敏度。定义为：在限定信噪比条件下，光接收机所需的最小信号光功率，以dBm为单位。假设系统只有量子噪声（理想光接收机），这样确定的灵敏度为（最高）极限灵敏度。 在大信号条件下，线性较差，发射机光源的输出功率特性是产生非线性失真的主要原因。 非线性失真一般可以用幅度失真参数——微分增益（DG）和相位失真参数——微分相位（DP）表示。需要进行补偿。 前馈法补偿 移相法调制法补偿 前馈与准前馈 预失真补偿法（光接收机）——微分相位四点补偿、微分增益补偿电路。 光端机 光发射机——发射光功率要大，非线性失真小，调制指数要适当大，温度稳定性好 光接收机——输出信噪比要高，幅频特性要好，带宽要足够，有自动增益控制、预放大和主放 3、副载波复用光纤传输系统评价传输质量的特性参数是：载噪比（CNR）和信号失真。 载噪比（CNR） 把满负载、无调制等幅载波置于传输系统，在规定的带宽内特定频道的载波功率（C）和噪声功率的比值。 提高CNR是系统设计的重要问题。增大调制指数会使得线性劣化，需要预失真技术。当平均光接受功率很大时，再增加功率不一定能够提高CNR。因此采用适当低的光功率和适当大的调制指数。 就载噪比而言，预调制方式FM优于VSB-AM。但是FM占用的频带较宽。 信号失真 ——载波信号源的半导体激光器在电光转换时的非线性效应。 组合二阶互调失真（CSO） 组合三阶差拍失真（CTB） CSO和CTB会以噪声的形式对图像产生干扰。 采用合理的频道频率配置。副载波的最高频率应小于最低频率的2倍。 限制调制指数m，以保证CSO和CTB符合规定的指标。超过阈值以下后可能会引起削波现象（削底和限顶）。 采取外调制的方式，把光载波的产生与调制分开，光源的光谱不会因为调制而展宽，这样没有附加的线性调频（啁啾）而产生的信号失真。 可供选择的光发射机： 直接调制1310nm分布反馈激光器发射机 外调制YAG光发射机 外调制1550nmDFB光发射机 光链路 六、光纤通信新技术1、光纤放大器——掺铒光纤放大器 掺铒光纤放大器工作原理 三价铒粒子的能级特性——基态、亚稳态、稳态 放大器的构成与原理 掺铒光纤（EDF）和高功率泵浦光源是主要器件。 980nm相比于1480nm的优点更为突出，980nm的泵浦光转换效率更高，且噪声较低，是未来发展的方向。 优点与应用 增益特性与光的偏振状态无关。 噪声系数小，频带宽。 应用有三种形式： 中继放大器（LA）——延长干线网的传输距离。 前置放大器（PA）——放大微弱的信号，改善接受灵敏度，对噪声要求严格。 后置放大器（BA）——提高发射功率，饱和输出光功率是主要参数。 2、光波复用技术光波复用技术（WDM）技术是在一根光纤上同时传输多个波长光信号的一项技术。基本原理是：在发送端将不同波长的光信号组合起来（复用），并耦合到光缆线路上的同一根光纤中进行传输，在接收端又将组合波长的光信号分开（解复用），并做进一步处理。恢复出原始信号。 在同一窗口中信道间隔较小的波分复用称为密集波分复用（DWDM）。 WDM的基本构成主要有两种方式： 双纤单向传输——单向的WDM传输是指所有波长的信道同时在一根光纤上沿着同一方向传输。 单线双向传输——光通路在一根光纤上有同时向两个不同方向传输。 WDM系统基本架构： 3、光滤波器——光栅 4、光交换技术传统电子交换机有限制，端口速率被限，实现全光通信是主要趋势。光交换是全光通信的关键技术。 空分光交换——使光信号的传输通路在空间上发生变化。其核心部件为光开关。 时分光交换——以时分复用为基础，用时隙交换原理来实现交换功能。会存在光延迟器件，通过不同的延迟时间最后用复接器将信号重新组合起来。 波分光交换——以波分复用为基础，采用波长选择或者波长变换的方法来实现交换功能。有波长选择法交换和波长变换法来交换。 5、光孤子通信光孤子是经光线长距离传输后，其宽度保持不变的超短光脉冲（ps数量级），光孤子的形成是光纤的群速度色散和非线性效应相平衡的结果。 光纤色散会引起脉冲展宽。多个放大器之后的噪声累加会产生非线性效应，可以调节适当的参数，使得两种效应相平衡。 6、相干光通信现有的光纤通信系统都是采用光强调制-直接检测（IM-DD）方式，但限制了系统的进一步发展。相干光通信，在发射端对光载波进行幅度、频率或相位调制；在接收端，则采用零差检测或者外差检测，称为相干检测。相干光检测原理图如下： 相干检测有零差检测和外差检测两种。 零差检测 信号光频率和本地光振荡器产生的频率相等。相位锁定在信号光相位上，灵敏度很高，但技术很复杂。 外差检测 信号光频率和光振荡频率不一样，外差检测的信噪比改善比零差检测低3dB，但相对简单。","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"线性代数","slug":"线性代数","date":"2023-03-02T10:24:02.000Z","updated":"2023-07-16T09:08:16.765Z","comments":true,"path":"2023/03/02/线性代数/","link":"","permalink":"http://example.com/2023/03/02/%E7%BA%BF%E6%80%A7%E4%BB%A3%E6%95%B0/","excerpt":"线性代数一、什么是线性代数 代数就是从许多事物中抽象出数与运算法则，接着进一步关心运算规律。将算数推广到比数更为抽象的对象（运算规则）上面去。 线性的本质就是因变量与自变量之间始终保持组合形式的一种对应关系。 线性映射就是把向量映射到向量，把线段映射到线段。 如果映射是发生在一个集合的同一个坐标系，线性映射就可被称为线性变换。","text":"线性代数一、什么是线性代数 代数就是从许多事物中抽象出数与运算法则，接着进一步关心运算规律。将算数推广到比数更为抽象的对象（运算规则）上面去。 线性的本质就是因变量与自变量之间始终保持组合形式的一种对应关系。 线性映射就是把向量映射到向量，把线段映射到线段。 如果映射是发生在一个集合的同一个坐标系，线性映射就可被称为线性变换。 二、向量的几何与物理意义 向量内积的几何解释就是一个向量在另一个向量的投影的积，也就是同方向的积。 像多项式一样的向量乘法叫做向量的直积。向量的直积是向量的一种最简单的乘法运算，其结果为张量（向量是一阶张量的一种），也称为向量的张量积。向量的张量积包含了向量的内积和外积的结果。 三、行列式行列式的基本知识 行列式从二元线性方程组中演化而来，用来对方程求解。 把n个不同的元素排成一排，叫做这n个元素的全排列。当某一元素的先后次序不同于标准次序时，就说它构成了逆序。逆序数为奇数的排列叫做奇序列，逆序数为偶数的序列叫做偶序列。 在排列中，将任意两个元素对调，其余的元素不同，这种做出新排列的手续叫做对换。将相邻两个元素对换，叫做相邻对换。 一个序列的任意两个元素对换，排列改变奇偶性。 奇排列兑换成标准排列的兑换次数为奇数，偶排列为偶数。（t为列元素的逆序数） \\left| \\begin{matrix} a_{11}& a_{12}& a_{13}\\\\ a_{21}& a_{22}& a_{23}\\\\ a_{31}& a_{32}& a_{33}\\\\ \\end{matrix} \\right| =a_{11}a_{22}a_{33}+a_{12}a_{23}a_{31}+a_{13}a_{21}a_{32}-a_{11}a_{23}a_{32}-a_{12}a_{21}a_{33}-a_{13}a_{22}a_{31} =\\left( -1 \\right) ^{-t}a_{1p_1}a_{2p_2}a_{3p_3}行列式的性质： 行列式与它的转置行列式相等。 对换行列式的两行（列），行列式变号。（如果行列式中有完全一样的行或列，则此行列式为0）。——叉积特性 行列式中的某一行列中的所有元素都乘同一数k，等于用数乘此行列式。——平行四边形面积，底翻倍，高不变 若行列式的某一行列的元素都是两数之和，则可分解为两个行列式之和。——面积 在n阶行列式中，把(i,j)元所在的第i行和第j列划去后，留下来的n-1阶行列式叫做(i,j)元的余子式。 代数余子式：A_{ij}=\\left( -1 \\right) ^{i+j}M_{ij}行列式等于它的任一行（列）的各元素与其对应的代数余子式乘积之和。（n阶行列式可以降为更低一阶的行列式） 行列式的几何意义行列式可以理解为行或者列向量所构成的超平行多面体的有向面积或有向体积。或者针对矩阵A的行列式就是线性变换A下的图形面积或者体积的伸缩因子。 二阶行列式可以看作是由行列式的向量所张成的平行四边形的面积，或者理解为两个行向量或者列向量的叉积的数值。 ······ 四、矩阵及其运算","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"人类简史","slug":"人类简史","date":"2023-02-03T08:07:35.000Z","updated":"2023-07-16T09:08:12.147Z","comments":true,"path":"2023/02/03/人类简史/","link":"","permalink":"http://example.com/2023/02/03/%E4%BA%BA%E7%B1%BB%E7%AE%80%E5%8F%B2/","excerpt":"人类简史❤ 一、书籍信息 作者: [以色列] 尤瓦尔·赫拉利出版社: 中信出版社出品方: 见识城邦副标题: 从动物到上帝原作名: A brief history of humankind译者: 林俊宏出版年: 2014-11页数: 440定价: 68.00元装帧: 平装ISBN: 9787508647357","text":"人类简史❤ 一、书籍信息 作者: [以色列] 尤瓦尔·赫拉利出版社: 中信出版社出品方: 见识城邦副标题: 从动物到上帝原作名: A brief history of humankind译者: 林俊宏出版年: 2014-11页数: 440定价: 68.00元装帧: 平装ISBN: 9787508647357 二、摘抄序 在他看来，正是这种罪恶的人类中心主义，把具有神一般的能力、本来应该成为宇宙间“正能量”的智人，变成了一种不负责任、贪得无厌又极具破坏力的怪兽，结果给地球生态带来了一场“毁天灭地的人类洪水”。 他对智人的所有批评，说到底只是一种“恨铁不成钢”的埋怨，而深藏于其中的，其实还是一种对人类命运的深深忧虑，以及对智人幡然悔悟、痛改前非的殷切期待。 因为一旦人们发现历史能证明乐无常态而知足常乐，发现我们过去对快乐的历史认知可能都是错的，发现对快感的执着追求可能只会适得其反地导致痛苦，那么我们就有可能走向对自己的真正理解，也就可能知道自己想要的究竟是什么了。 人类一种也没特别的动物 智人一直希望自己和其他动物有所不同，仿佛整个科就只有自己的存在，没有兄弟姐妹，没有远近亲戚，而且最重要的是：没有父母。但可惜这绝非事实。 对智人来说，没有其他同属人类的物种，就很容易让人自以为是造物的极致，以为自己和其他整个动物界仿佛隔着一条护城河。 知善恶树（认知革命） 最常见的理论，认为人类语言最为灵活。虽然我们只能发出有限的声音，但组合起来却能产生无限多的句子，各有不同的含义。 第二种理论，也同意人类语言是沟通关于世界的信息的方式。然而，最重要的信息不是关于狮子和野牛，而是关于人类自己。我们的语言发展成了一种八卦的工具。 人类语言真正最独特的功能，并不在于能够传达关于人或狮子的信息，而是能够传达关于一些根本不存在的事物的信息。然而，“虚构”这件事的重点不只在于让人类能够拥有想象，更重要的是可以“一起”想象，编织出种种共同的虚构故事。 无论是现代国家、中世纪的教堂、古老的城市，或者古老的部落，任何大规模人类合作的根基，都在于某种只存在于集体想象中的虚构故事。 集体想象的故事可以突破150人的“八卦”限制，达到共同合作。 多年来，人类已经编织出了一个极其复杂的故事网络。在这个网络中，像标致公司这种虚构的故事不仅存在，而且力量强大。 从认知革命以来，智人一直就生活在一种双重的现实之中。一方面，我们有像是河流、树木和狮子这种确实存在的客观现实；而另一方面，我们也有像是神、国家和企业这种想象中的现实。 自从认知革命之后，智人就能依据不断变化的需求迅速调整行为。这等于开启了一条采用“文化演化”的快速道路，而不再停留在“基因演化”这条总是堵车的道路上。 认知革命正是历史从生物学中脱离而独立存在的起点。 生物学与历史的关系： 基本上，生物学为智人的行为和能力设下了基本限制，像是定出了一个活动范围，而所有的历史都在这个范围之内发生。 然而，这个范围非常大，能让智人有各种惊人的发挥空间。因为他们有创造虚构故事的能力，就能创造出更多、更复杂的游戏，代代相传也就不断发展精进。 因此，想了解智人的行为，就必须描述人类行为的历史演化。光是考虑人类在生物上的限制，就像是今天要去播报一场足球世界杯赛事，只不断报道关于场地的信息，而对球员究竟做了什么只字不提。 亚当和夏娃的一天（认知革命之后、农业革命之前） 演化心理学近来发展蓬勃，认为现在人类的各种社会和心理特征早从农业时代之前就已经开始形塑。 虽然用人类学方式观察现代的采集社会可以帮助我们了解一些远古采集社会的种种可能性，但这绝非全貌，而且可以说绝大多数仍不得而知。 就整体而言，现今人类所知远超过远古人类。但在个人层面上，远古的采集者则是有史以来最具备多样知识和技能的人类。 采集者之所以能够免受饥饿或营养不良的困扰，秘诀就在于多样化的饮食。 正因为这些在农业时代前的采集者有健康和多样化的饮食、相对较短的工作时间，也少有传染病的发生，许多专家将这种社会定义为“最初的富裕社会”。 多数学者都同意，远古的采集者普遍信奉泛神论的信仰。 远古的采集活动生活，对于我们是空白的。在这段时间内，采集社会有着不同的宗教和社会结构，可能有战争与革命，有灵性激昂的宗教运动，有深刻的哲学理论，有无与伦比的艺术杰作。这幅沉默的帷幕就这样罩住了几万年的历史。但我们并不能视而不见，他们事实上也做了很多大事，让地球的生态改头换面。 毁天灭地的人类洪水（认知革命之后） 大约在45000年前的智人发展出了第一个能够航海的人类社会。这给人类的能力及生活形态带来了前所未有的变革。相比于经过长期演化发展出专门的器官和符合流体力学的身形的其他哺乳类生物，人类有着特别的优势。而这也确定了当狩猎采集者首次登上澳大利亚海滩的那一刻，就正式跃居食物链顶端，称为地球上最致命的生物，使得澳大利亚的生态系统发生了翻天覆地的变化。 人类看起来就是个生态的连环杀手。 对这些动物来说，需要靠演化才能学会惧怕人类，但时间根本不够，它们转眼便已灭绝。 智人的第一波殖民正是整个动物界最大也最快速的一场生态浩劫。其中受创最深的是那些大型、毛茸茸的动物。 第一波的灭绝浪潮是由于采集者的扩张，接着第二波灭绝浪潮则是因为农民的扩张； 对全世界上所有的大型动物来说，这场人类洪水的唯一幸存者可能只剩下人类自己，还有其他登上诺亚方舟但只作为人类盘中佳肴的家禽家畜。 史上最大骗局（农业革命）学者宣称农业革命是人类的大跃进，是由人类脑力所推动的进步故事。人们可以放弃狩猎采集的艰苦、危险、简陋，安定下来，享受农民愉快而饱足的生活。","categories":[],"tags":[{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"}]}],"categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"},{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"}]}