{"meta":{"title":"Hexo","subtitle":"","description":"","author":"jeacry","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"人类简史","slug":"人类简史","date":"2023-02-26T09:57:14.000Z","updated":"2023-02-26T10:08:45.974Z","comments":true,"path":"2023/02/26/人类简史/","link":"","permalink":"http://example.com/2023/02/26/%E4%BA%BA%E7%B1%BB%E7%AE%80%E5%8F%B2/","excerpt":"","text":"人类简史（半成品） 一、书籍信息 作者: [以色列] 尤瓦尔·赫拉利出版社: 中信出版社出品方: 见识城邦副标题: 从动物到上帝原作名: A brief history of humankind译者: 林俊宏出版年: 2014-11页数: 440定价: 68.00元装帧: 平装ISBN: 9787508647357 二、摘抄序 在他看来，正是这种罪恶的人类中心主义，把具有神一般的能力、本来应该成为宇宙间“正能量”的智人，变成了一种不负责任、贪得无厌又极具破坏力的怪兽，结果给地球生态带来了一场“毁天灭地的人类洪水”。 他对智人的所有批评，说到底只是一种“恨铁不成钢”的埋怨，而深藏于其中的，其实还是一种对人类命运的深深忧虑，以及对智人幡然悔悟、痛改前非的殷切期待。 因为一旦人们发现历史能证明乐无常态而知足常乐，发现我们过去对快乐的历史认知可能都是错的，发现对快感的执着追求可能只会适得其反地导致痛苦，那么我们就有可能走向对自己的真正理解，也就可能知道自己想要的究竟是什么了。 人类一种也没特别的动物 智人一直希望自己和其他动物有所不同，仿佛整个科就只有自己的存在，没有兄弟姐妹，没有远近亲戚，而且最重要的是：没有父母。但可惜这绝非事实。 对智人来说，没有其他同属人类的物种，就很容易让人自以为是造物的极致，以为自己和其他整个动物界仿佛隔着一条护城河。 知善恶树（认知革命） 最常见的理论，认为人类语言最为灵活。虽然我们只能发出有限的声音，但组合起来却能产生无限多的句子，各有不同的含义。 第二种理论，也同意人类语言是沟通关于世界的信息的方式。然而，最重要的信息不是关于狮子和野牛，而是关于人类自己。我们的语言发展成了一种八卦的工具。 人类语言真正最独特的功能，并不在于能够传达关于人或狮子的信息，而是能够传达关于一些根本不存在的事物的信息。然而，“虚构”这件事的重点不只在于让人类能够拥有想象，更重要的是可以“一起”想象，编织出种种共同的虚构故事。 无论是现代国家、中世纪的教堂、古老的城市，或者古老的部落，任何大规模人类合作的根基，都在于某种只存在于集体想象中的虚构故事。 集体想象的故事可以突破150人的“八卦”限制，达到共同合作。 多年来，人类已经编织出了一个极其复杂的故事网络。在这个网络中，像标致公司这种虚构的故事不仅存在，而且力量强大。 从认知革命以来，智人一直就生活在一种双重的现实之中。一方面，我们有像是河流、树木和狮子这种确实存在的客观现实；而另一方面，我们也有像是神、国家和企业这种想象中的现实。 自从认知革命之后，智人就能依据不断变化的需求迅速调整行为。这等于开启了一条采用“文化演化”的快速道路，而不再停留在“基因演化”这条总是堵车的道路上。 认知革命正是历史从生物学中脱离而独立存在的起点。 生物学与历史的关系： 基本上，生物学为智人的行为和能力设下了基本限制，像是定出了一个活动范围，而所有的历史都在这个范围之内发生。 然而，这个范围非常大，能让智人有各种惊人的发挥空间。因为他们有创造虚构故事的能力，就能创造出更多、更复杂的游戏，代代相传也就不断发展精进。 因此，想了解智人的行为，就必须描述人类行为的历史演化。光是考虑人类在生物上的限制，就像是今天要去播报一场足球世界杯赛事，只不断报道关于场地的信息，而对球员究竟做了什么只字不提。 亚当和夏娃的一天（认知革命之后、农业革命之前） 演化心理学近来发展蓬勃，认为现在人类的各种社会和心理特征早从农业时代之前就已经开始形塑。 虽然用人类学方式观察现代的采集社会可以帮助我们了解一些远古采集社会的种种可能性，但这绝非全貌，而且可以说绝大多数仍不得而知。 就整体而言，现今人类所知远超过远古人类。但在个人层面上，远古的采集者则是有史以来最具备多样知识和技能的人类。 采集者之所以能够免受饥饿或营养不良的困扰，秘诀就在于多样化的饮食。 正因为这些在农业时代前的采集者有健康和多样化的饮食、相对较短的工作时间，也少有传染病的发生，许多专家将这种社会定义为“最初的富裕社会”。 多数学者都同意，远古的采集者普遍信奉泛神论的信仰。 远古的采集活动生活，对于我们是空白的。在这段时间内，采集社会有着不同的宗教和社会结构，可能有战争与革命，有灵性激昂的宗教运动，有深刻的哲学理论，有无与伦比的艺术杰作。这幅沉默的帷幕就这样罩住了几万年的历史。但我们并不能视而不见，他们事实上也做了很多大事，让地球的生态改头换面。 毁天灭地的人类洪水（认知革命之后） 大约在45000年前的智人发展出了第一个能够航海的人类社会。这给人类的能力及生活形态带来了前所未有的变革。相比于经过长期演化发展出专门的器官和符合流体力学的身形的其他哺乳类生物，人类有着特别的优势。而这也确定了当狩猎采集者首次登上澳大利亚海滩的那一刻，就正式跃居食物链顶端，称为地球上最致命的生物，使得澳大利亚的生态系统发生了翻天覆地的变化。 人类看起来就是个生态的连环杀手。 对这些动物来说，需要靠演化才能学会惧怕人类，但时间根本不够，它们转眼便已灭绝。 智人的第一波殖民正是整个动物界最大也最快速的一场生态浩劫。其中受创最深的是那些大型、毛茸茸的动物。 第一波的灭绝浪潮是由于采集者的扩张，接着第二波灭绝浪潮则是因为农民的扩张； 对全世界上所有的大型动物来说，这场人类洪水的唯一幸存者可能只剩下人类自己，还有其他登上诺亚方舟但只作为人类盘中佳肴的家禽家畜。 史上最大骗局（农业革命）","categories":[],"tags":[{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"}]},{"title":"数字信号处理总结","slug":"数字信号处理总结","date":"2023-02-03T08:07:35.000Z","updated":"2023-02-04T07:26:04.874Z","comments":true,"path":"2023/02/03/数字信号处理总结/","link":"","permalink":"http://example.com/2023/02/03/%E6%95%B0%E5%AD%97%E4%BF%A1%E5%8F%B7%E5%A4%84%E7%90%86%E6%80%BB%E7%BB%93/","excerpt":"","text":"数字信号处理总结 一、 时域离散信号与时域离散系统 线性卷积公式： 序列与冲激序列的卷积： x(n－n0)&#x3D;x(n)*δ(n－n0) 采样定理的重要公式：","categories":[],"tags":[{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]},{"title":"test_my_site","slug":"test-my-site","date":"2023-01-27T12:37:21.000Z","updated":"2023-01-27T12:39:10.778Z","comments":true,"path":"2023/01/27/test-my-site/","link":"","permalink":"http://example.com/2023/01/27/test-my-site/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub.","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"读书","slug":"读书","permalink":"http://example.com/tags/%E8%AF%BB%E4%B9%A6/"},{"name":"学习总结","slug":"学习总结","permalink":"http://example.com/tags/%E5%AD%A6%E4%B9%A0%E6%80%BB%E7%BB%93/"}]}